window.addEventListener("load",()=>
{
    setPlayerInformation();
})

function setPlayerInformation()
{
    //URLからクエリを読み込み
    let url = window.location.href;
    let occupation_num = []
    let ver = 1;
    url = decodeURI(url);
    url = url.split("?");
    if(url.length == 1)
    {
        url = [];
    }
    else
    {
        url = url[1];
        url = url.split("&");
    }
    //クエリの代入
    let dummy_url_data;
    for(let i = 0; i < url.length; i++)
    {
        dummy_url_data = url[i].split("=");
        if(dummy_url_data.length==2)
        {
            switch(dummy_url_data[0])
            {
                case "name":
                    player_information.name = dummy_url_data[1];
                    break;
                case "age":
                    player_information.age = dummy_url_data[1];
                    break;
                case "sex":
                    player_information.sex = dummy_url_data[1];
                    break;
                case "occupation":
                    player_information.occupation = dummy_url_data[1];
                    break;
                case "ver":
                    switch(dummy_url_data[1])
                    {
                        case "1":
                            ver = 1;
                            player_sheet_tmp.ability_scores.str = {"type":"number", "title":"STR", "dice":[3,6]};
                            player_sheet_tmp.ability_scores.con = {"type":"number", "title":"CON", "dice":[3,6]};
                            player_sheet_tmp.ability_scores.pow = {"type":"number", "title":"POW", "dice":[3,6]};
                            player_sheet_tmp.ability_scores.dex = {"type":"number", "title":"DEX", "dice":[3,6]};
                            player_sheet_tmp.ability_scores.app = {"type":"number", "title":"APP", "dice":[3,6]};
                            player_sheet_tmp.ability_scores.siz = {"type":"number", "title":"SIZ", "dice":[2,6,6]};
                            player_sheet_tmp.ability_scores.int = {"type":"number", "title":"INT", "dice":[2,6,6]};
                            player_sheet_tmp.ability_scores.edu = {"type":"number", "title":"EDU", "dice":[3,6,3]};

                            player_sheet_tmp.ability_scores.san = {"type":"number", "title":"SAN", "calc":[["pow"],5]};
                            player_sheet_tmp.ability_scores.luc = {"type":"number", "title":"幸運", "calc":[["pow"],5]};
                            player_sheet_tmp.ability_scores.ida = {"type":"number", "title":"アイデア", "calc":[["int"],5]};
                            player_sheet_tmp.ability_scores.know = {"type":"number", "title":"知識", "calc":[["edu"],5]};
                            player_sheet_tmp.ability_scores.hp = {"type":"number", "title":"HP", "calc":[["con","siz"],0.5]};
                            player_sheet_tmp.ability_scores.mp = {"type":"number", "title":"MP", "calc":[["pow"],1]};
                            player_sheet_tmp.ability_scores.db = {"type":"text", "title":"DB", "condition":[1,["str","siz"],[[[0,12],"-1d6"],[[13,16],"-1d4"],[[25,32],"1d4"],[[33,40],"1d6"]]]};
                            player_sheet_tmp.ability_scores.oc_p = {"type":"number", "title":"職業P", "calc":[["edu"],20]};
                            player_sheet_tmp.ability_scores.hb_p = {"type":"number", "title":"趣味P", "calc":[["int"],10]};
                            break;
                        case "2":
                        default:
                            ver = 2;
                            player_sheet_tmp.ability_scores.str = {"type":"number", "title":"STR", "dice":[3,6,0,5]};
                            player_sheet_tmp.ability_scores.con = {"type":"number", "title":"CON", "dice":[3,6,0,5]};
                            player_sheet_tmp.ability_scores.pow = {"type":"number", "title":"POW", "dice":[3,6,0,5]};
                            player_sheet_tmp.ability_scores.dex = {"type":"number", "title":"DEX", "dice":[3,6,0,5]};
                            player_sheet_tmp.ability_scores.app = {"type":"number", "title":"APP", "dice":[3,6,0,5]};
                            player_sheet_tmp.ability_scores.siz = {"type":"number", "title":"SIZ", "dice":[2,6,6,5]};
                            player_sheet_tmp.ability_scores.int = {"type":"number", "title":"INT", "dice":[2,6,6,5]};
                            player_sheet_tmp.ability_scores.edu = {"type":"number", "title":"EDU", "dice":[2,6,6,5]};
                            player_sheet_tmp.ability_scores.luk = {"type":"number", "title":"LUK", "dice":[2,6,6,5]};

                            player_sheet_tmp.ability_scores.san = {"type":"number", "title":"SAN", "calc":[["pow"],1]};
                            player_sheet_tmp.ability_scores.ida = {"type":"number", "title":"アイデア", "calc":[["int"],1]};
                            player_sheet_tmp.ability_scores.know = {"type":"number", "title":"知識", "calc":[["edu"],1]};
                            player_sheet_tmp.ability_scores.hp = {"type":"number", "title":"HP", "calc":[["con","siz"],0.1]};
                            player_sheet_tmp.ability_scores.mp = {"type":"number", "title":"MP", "calc":[["pow"],0.2]};
                            player_sheet_tmp.ability_scores.db = {"type":"text", "title":"DB", "condition":[1,["str","siz"],[[[0,64],"-2"],[[65,84],"-1"],[[125,164],"1d4"],[[165,204],"1d6"],[[205,284],"2d6"],[[285,364],"3d6"],[[365,444],"4d6"],[[445,524],"5d6"]]]};
                            player_sheet_tmp.ability_scores.b = {"type":"text", "title":"B", "condition":[1,["str","siz"],[[[0,64],"-2"],[[65,84],"-1"],[[125,164],"1"],[[165,204],"2"],[[205,244],"3"],[[245,284],"4"],[[285,324],"5"],[[325,364],"6"]]]};
                            //DEX, STRともにSIZより小さい→7, でない→8 年齢が40代→MOV-1, 50→-2, ...80→5
                            player_sheet_tmp.ability_scores.mov = {"type":"number", "title":"MOV", "condition":[2,["str","dex"],"siz",[7,8],player_information,[[[40,49],-1],[[50,59],-2],[[60,69],-3],[[70,79],-4],[[80,999],-5]]]};
                            player_sheet_tmp.ability_scores.oc_p = {"type":"number", "title":"職業P", "condition":[3, occupation_num]};
                            player_sheet_tmp.ability_scores.hb_p = {"type":"number", "title":"趣味P", "calc":[["int"],2]};
                            break;
                    }
                    break;
            }
        }
    }
    //性別の確認
    switch(player_information.sex)
    {
        case "x":
        case null:
        case undefined:
            let rand_num = randomRange(1,2);
            if(rand_num==1){ player_information.sex = "男性"; }
            else{ player_information.sex = "女性"; }
            break;
        case "m":
            player_information.sex = "男性";
            break;
        case "f":
            player_information.sex = "女性";
            break;
        default:
            player_information.sex = player_information.sex;
            break;
    }
    //名前の確認
    if(player_information.name == null)
    {
        player_information.name = "";
        player_information.name += name_data.last_2a[randomRange(0, name_data.last_2a.length - 1)];
        player_information.name += name_data.last_2b[randomRange(0, name_data.last_2b.length - 1)];
        player_information.name += " ";
        switch(player_information.sex)
        {
            case "男性":
                player_information.name += name_data.first_m_2a[randomRange(0, name_data.first_m_2a.length - 1)];
                player_information.name += name_data.first_m_2b[randomRange(0, name_data.first_m_2b.length - 1)];
                break;
            case "女性":
                player_information.name += name_data.first_f_2a[randomRange(0, name_data.first_f_2a.length - 1)];
                player_information.name += name_data.first_f_2b[randomRange(0, name_data.first_f_2b.length - 1)];
                break;
            default:
                let rand_num = randomRange(1,2);
                if(rand_num == 1){ player_information.name += name_data.first_m_2a[randomRange(0, name_data.first_m_2a.length - 1)];}
                else{ player_information.name += name_data.first_f_2a[randomRange(0, name_data.first_f_2a.length - 1)]; }
                rand_num = randomRange(1,2);
                if(rand_num == 1){ player_information.name += name_data.first_m_2b[randomRange(0, name_data.first_m_2b.length - 1)];}
                else{player_information.name += name_data.first_f_2b[randomRange(0, name_data.first_f_2b.length - 1)];}
                break;
        }
    }
    //職業の設定
    if(player_information.occupation==null)
    {
        occupation_num[0] = randomRange(0, occupation_data.length - 1);
        occupation_num[1] = randomRange(0, occupation_data[occupation_num[0]].occupation.length - 1);
        player_information.occupation = occupation_data[occupation_num[0]].occupation[occupation_num[1]];
    }
    else
    {
        for(let i = 0; i < occupation_num_dictionary.length; i++)
        {
            if(occupation_num_dictionary[i].occupation == player_information.occupation)
            {
                occupation_num = occupation_num_dictionary[i].num;
                break;
            }
        }
    }
    //年齢
    if(player_information.age == null)
    {
        player_information.age = Math.floor(20 + 60.0/( 1 + Math.pow(Math.random() * 5, 2))) + randomRange(-5, 5);
    }
    //出身地
    if(player_information.birth_place == null)
    {
        let rand_num = randomRange(0, birth_place.length - 1);
        player_information.birth_place = birth_place[rand_num];
    }
    //シートに入力
    let element = document.getElementById("player_information");
    element.innerHTML = makeTable(player_sheet_tmp.player_information, player_information, 4);

    //能力値の代入
    if(Object.keys(ability_scores).length == 0)
    {
        const pair = Object.entries(player_sheet_tmp.ability_scores);
        for(const [key, value] of pair)
        {
            if(value.dice!=null)
            {
                ability_scores[key] = diceRoll(value.dice);
            }
            else if(value.calc != null)
            {
                ability_scores[key] = calcAbilityScore(ability_scores, value.calc);
            }
            else if(value.condition != null)
            {
                ability_scores[key] = checkConditionScore(ability_scores, value.condition);
            }
            else
            {
                ability_scores[key] = 0;
            }
        }
    }
    element = document.getElementById("ability_score");
    element.innerHTML = makeTable(player_sheet_tmp.ability_scores, ability_scores, 6);
    //身長の代入
    if(ability_scores.siz != null)
    {
        let height;
        switch(ver)
        {
            case 1:
                height = 134 + Math.floor(2.5 * ability_scores.siz) + randomRange(-7,7);
                element = document.getElementById("height");
                element.value = height + " cm";
                break;
            case 2:
                height = 134 + Math.floor(2.5 * ability_scores.siz / 5) + randomRange(-7,7);
                element = document.getElementById("height");
                element.value = height + " cm";
            default:
                break;
        }
    }
    //スキルの割り振り
    //30~70適当な場所に
    if(occupation_num.length != 2){ occupation_num = [occupation_data.length - 1, 0];}
    if(occupation_num.length == 2)
    {
        let skill_list = occupation_data[occupation_num[0]].skills;
        //5~8つのスキルを選択
        let rand_num = randomRange(Math.max(0,skill_list.length-8),Math.max(0,skill_list.length-5));
        for(let i = 0; i < rand_num; i++)
        {
            skill_list.shift(randomRange(0, skill_list.length - 1));
        }
        if(ability_scores.oc_p == null){ability_scores.oc_p = 0;}
        let now_point = ability_scores.oc_p/5;
        for(let i = 0; i < skill_list.length; i++)
        {
            if(now_point <= 0){ break; }
            for(let j = 0; j < skill_data.length; j++)
            {
                if(skill_list[i] == skill_data[j].occupation)
                {
                    skills[i] = {"title":skill_list[i],"s":skill_data[j].p,"o":5,"h":0,"t":5};
                    if(typeof(skill_data[j].p)=="number")
                    {
                        skills[i].t += skill_data[j].p;
                    }
                    else
                    {
                        skills[i].s = ability_scores[skill_data[j].p[0]] * skill_data[j].p[1];
                        skills[i].t += skills[i].s;
                    }
                    now_point--;
                }
            }
        }
        //適当に代入
        for(let i = 0; i < 200; i++)
        {
            if(now_point <= 0){break;}
            rand_num = randomRange(0, skill_list.length - 1);
            if(skills[rand_num].t < 80)
            {
                skills[rand_num].o += 5;
                skills[rand_num].t += 5;
                now_point--;
            }
        }
    }
    //趣味スキルの割り振り
    if(ability_scores.hb_p != null)
    {
        //16~36pある
        let now_point = ability_scores.hb_p / 5;
        let rand_num = randomRange(Math.ceil(now_point/5), Math.ceil(now_point/3.5));
        let select_n = 0;
        let skill_list = [];
        //適当に抽選
        for(let i = 0; i < rand_num; i++)
        {
            select_n = randomRange(0, skill_data.length - 1);
            skill_list[i] = skill_data[select_n];
            skill_data.shift(select_n);
        }
        //初期値を代入
        let flag = false;
        let job_n = 0;
        for(let i = 0; i < skill_list.length; i++)
        {
            flag = false;
            for(let j = 0; j < skills.length; j++)
            {
                if(skills[j].title == skill_data[i].occupation)
                {
                    flag = true;
                    job_n = j;
                    break;
                }
            }
            if(flag == false)
            {
                skills[skills.length] = {"title":skill_list[i].occupation,"s":skill_list[i].p,"o":0,"h":5,"t":5};
                if(typeof(skill_list[i].p)=="number")
                {
                    skills[skills.length-1].t += skill_list[i].p;
                }
                else
                {
                    skills[skills.length-1].t += ability_scores[skill_list[i].p[0]] * skill_list[i].p[1];
                    skills[skills.length-1].s = ability_scores[skill_list[i].p[0]] * skill_list[i].p[1];
                }
                now_point--;
            }
            else
            {
                skills[job_n].h += 5;
                skills[job_n].t += 5;
                now_point--;
            }
        }
        //スキル割り振り
        for(let i = 0; i < 200; i++)
        {
            if(now_point <= 0){break;}
            rand_num = randomRange(0, skill_list.length - 1);
            if(skills[rand_num].t < 80)
            {
                skills[rand_num].h += 5;
                skills[rand_num].t += 5;
                now_point--;
            }
        }
    }
    element = document.getElementById("skills");
    element.innerHTML = makeTable2(skills, 4);
}

function makeTable(base, data, x)
{
    let dummy_txt = "<table>";
    let x_count = 0;
    const pair = Object.entries(base);
    for(const [key, value] of pair)
    {
        if(x_count == 0){ dummy_txt += "<tr>";}
        dummy_txt += "<th>" + value.title + "</th>";
        if(value.x == null){ dummy_txt += '<td>'; x_count+=2;}
        else{ dummy_txt += "<td colspan='" + value.x + "'>"; x_count += value.x + 1;}
        dummy_txt += '<input type="'+value.type+'" id="'+key+'" value="';
        if(data[key] != null){ dummy_txt += data[key]; }
        dummy_txt += '"></td>';
        if(x_count >= x){ dummy_txt += "</tr>"; x_count = 0;}
    }
    dummy_txt += "</table>";
    return dummy_txt;
}

function makeTable2(data, x)
{
    let dummy_txt = "<table>";
    dummy_txt += "<tr><th></th><th>初期</th><th>職P</th><th>趣P</th><th>合計</th></tr>";
    let x_count = 0;
    for(let i = 0; i < data.length; i++)
    {
        if(x_count == 0){dummy_txt+="<tr>"}
        dummy_txt += "<th>" + data[i].title + "</th><td><input type='number' value='" + data[i].s + "'></td><td><input type='number' value='" + data[i].o + "'></td><td><input type='number' value='" + data[i].h + "'></td><td><input type='number' value='" + data[i].t + "'></td>";
        x_count +=4;
        if(x_count >= x){ dummy_txt+= "</tr>"; x_count = 0; }
    }
    dummy_txt += "</table>";
    return dummy_txt;
}

function diceRoll(data)
{
    if(data==null){ data=[1,6,0,1];}
    switch(data.length)
    {
        case 1:
            data = [1,data[0],0,1];
            break;
        case 2:
            data = [data[0], data[1], 0, 1];
            break;
        case 3:
            data.push(1);
            break;
        case 4:
            break;
        default:
            data = [1,6,0,1];
            break;
    }
    let n = 0;
    for(let i = 0; i < data[0]; i++)
    {
        n += Math.ceil(Math.random()*data[1]);
    }
    return Math.floor( ( n + data[2]) * data[3]);
}

function calcAbilityScore(data, array)
{
    let n = 0;
    let dummy;
    if(array.length != 2){ return 0; }
    if(array[0].length == 0){ return 0;}
    for(let i = 0; i < array[0].length; i++)
    {
        dummy = data[array[0][i]]
        if(dummy!=null){ n += dummy; }
    }
    return Math.ceil(n * array[1]);
}

function checkConditionScore(data, array)
{
    if(array==null || array.length == 0){return 0;}
    switch(array[0])
    {
        case 1:
            if(array.length != 3){ return 0;}
            let dummy;
            let n = 0;
            for(let i = 0; i < array[1].length; i++)
            {
                dummy = data[array[1][i]];
                if(dummy != null){ n += dummy;}
            }
            for(let i = 0; i < array[2].length; i++)
            {
                if(array[2][i].length != 2){ continue; }
                if(array[2][i][0].length != 2){ continue; }
                if(array[2][i][0][0] <= n && n <= array[2][i][0][1])
                { return array[2][i][1]}
            }
            return "0";
            break;
        case 2:
            let flag = false;
            if(array.length != 6){ return 0; }
            let dummy2 = data[array[2]];
            if(array[3].length != 2){ return 0;}
            let n2 = array[3][0];
            if(dummy2 == null){ return 0; }
            const conpared = dummy2;
            for(let i = 0; i < array[1].length; i++)
            {
                dummy2 = data[array[1][i]];
                if(dummy2 == null){ continue; }
                if(dummy2 >= conpared ){flag = true; break;}
            }
            if(flag == true){ n2 = array[3][1];}
            const age = array[4].age;
            if(age == null){return n2;}
            for(let i = 0; i < array[5].length; i++)
            {
                if(array[5][i].length != 2){ continue; }
                if(array[5][i][0].length != 2){ continue; }
                if(array[5][i][0][0] <= age && age <= array[5][i][0][1]){ return n2 + array[5][i][1]}
            }
            return n2;
            break;
        case 3:
            if(array.length != 2){ return 0;}
            if(array[1].length != 2 && array[1].length == 0){ return 0;}
            let job_n = -1;
            let dummy3;
            let n3 = 0;
            if(array[1].length == 2){ job_n = array[1][0]}
            switch(job_n)
            {
                case 1:
                case 2:
                case 3:
                case 6:
                case 7:
                case 8:
                case 11:
                case 16:
                case 18:
                    dummy3 = ability_scores["edu"];
                    if(dummy3 == null){ return 0;}
                    n3 = dummy3 * 4;
                    break;
                case 10:
                case 17:
                case 19:
                    dummy3 = ability_scores["edu"];
                    if(dummy3 == null){ return 0;}
                    n3 = dummy3 * 2;
                    dummy3 = ability_scores["app"];
                    if(dummy3 == null){ return 0;}
                    n3 += dummy3 * 2;
                    break;
                case 4:
                case 5:
                case 9:
                case 12:
                case 13:
                case 14:
                case 20:
                case 21:
                case 22:
                    dummy3 = ability_scores["edu"];
                    if(dummy3 == null){ return 0;}
                    n3 = dummy3 * 2;
                    dummy3 = ability_scores["dex"];
                    if(dummy3 == null){ return 0;}
                    n3 += dummy3 * 2;
                    break;
                case 15:
                case 23:
                    dummy3 = ability_scores["edu"];
                    if(dummy3 == null){ return 0;}
                    n3 = dummy3 * 2;
                    dummy3 = ability_scores["str"];
                    if(dummy3 == null){ return 0;}
                    n3 += dummy3 * 2;
                    break;
                default:
                    dummy3 = ability_scores["edu"];
                    if(dummy3 == null){ return 0;}
                    n3 = dummy3 * 4;
                    break;
            }
            return n3;
            break;
    }
}

function randomRange(min, max)
{
    return min + Math.floor((max - min + 1) * Math.random());
}

let player_information = {};
let ability_scores = {};
let skills = [];

let player_sheet_tmp = 
{
    "player_information":
    {
        "player":{"type":"text", "x":3, "title":"プレイヤー"},
        "name":{"type":"text", "x":3, "title":"探索者名"},
        "occupation":{"type":"text", "x":3, "title":"職業"},
        "birth_place":{"type":"text", "x":3, "title":"出身"},
        "age":{"type":"text", "title":"年齢"},
        "sex":{"type":"text", "title":"性別"},
        "height":{"type":"text", "title":"身長"},
        "nb_tag":{"type":"text", "title":"備考"}
    },
    "ability_scores":
    {},
    "skills":
    [
        {
            "name":"",
            "default_point":"",
            "oc_p":"",
            "hb_p":"",
            "ot_p":"",
            "total_p":""
        }
    ],
    "equipments":
    [
        {
            "name":"",
            "price":"",
            "quantitiy":"",
            "description":""
        }
    ],
    "description":[],
    "memo":[]
}

const name_data={
    "last_1":["林","森","原","関","東","辻","堀","南","岡","西","谷","星","堤","泉","岸","菅","畑","柳","橘","平","牧","秦","奥","島","乾","角","北","楠","中","沖","滝","浜","今","境","伴","湊","浦","金","坂","梶","堺","榊","椿","仲","沢","塙","城","長","桂","芝","柴","神","佃","脇","藤","磯","新","巽","峯","嶋","所","榎","李","迫","柏","杉","向","峰","澤","宮","舘","前","荒","高","鶴","表","栄","筧","池","清","盛","轟","武","宗","郡","丹","渡","室","畠","俵","郷","館","勝","旭","丸","里","篠","泊","槙","鏡","幸","張","源","近","窪","上","龍","間","笠","門","笹","黛","薮","進","濱","昆","安","迎","碇","圷","瀧","朴","呉","靏","陳","橋","守","薄","峠","王","栁","麓","荻","叶","粂","萩","倉","井","下","枝","嵐","登","鄭","英","蒲","園","本","沼","開","斎","戎","内","越","山","扇","栫","梯","黄","幅","楯","管","勇","潮","巴","硲","県","粂","萩","倉","井","下","枝","嵐","登","鄭","英","蒲","園","本","沼","開","斎","戎","内","越","山","扇","栫","梯","黄","幅"],
    "last_2a":["佐","鈴","高","田","伊","渡","山","中","小","加","吉","山","佐々","山","松","井","木","斎","清","山","池","橋","阿","石","山","中","石","小","前","岡","長谷","藤","後","近","村","遠","青","坂","斉","福","太","西","藤","金","岡","藤","中","三","原","中","松","竹","小","田","中","和","石","森","上","内","柴","酒","宮","横","高","安","宮","大","小","谷","今","工","高","増","丸","杉","村","大","新","小","平","藤","河","上","野","武","松","千","岩","菅","木","久","佐","野","松","市","菊","杉","古","島","大","水","桜","高","吉","渡","山","飯","西","菊","西","小","北","安","五十","川","平","中","久保","服","岩","土","川","福","本","樋","秋","永","田","山","中","吉","川","石","大","松","馬","浜","森","星","浅","矢","大","松","小","吉","野","荒","大","内","松","熊","黒","尾","永","望","川","田","荒","松","大","早","平","栗","菅","西","広","横","石","萩","岩","片","関","宮","大","高","吉","本","須","岡","小","伊","鎌","上","篠","小","松","福","古","小","大","成","奥","内","川","沢","桑","三","片","杉","富","八","奥","小","松","北","関","河","平","牧","白","今","寺","青","中","小","渋","上","小野","大","足","岡","坂","天","多","佐","根","豊","田","飯","角","村","武","白","竹","宮","榎","塚","神","坂","水","児","坂","齋","浅","小","岡","森","神","小笠","中","植","河","宮","稲","前","大","松","長","若","飯","大","石","安","堀","及","田","中","江","山","中","岸","荒","本","西","森","岡","金","細","今","戸","稲","安","津","森","落","土","村","町","三","畠","岩","長","中","野","中","金","米","松","杉","堀","西","三","山","佐","黒","西","大","甲","大","笠","堀","川","徳","須","黒","山","古","榊","梅","新","三","野","大","村","金","奥","土","滝","大","川","井","梶","大","宮","比","長","吉","宮","金","安","庄","大","茂","荻","日","松","向","下","塚","石","西","奥","竹","広","嶋","栗","藤","福","北","藤","宇","川","丹","谷","小","青","吉","藤","竹","竹","古","緒","藤","平","亀","高","三","篠","藤","窪","宮","根","高","下","高","山","川","柳","小","横","吉","出","武","小","竹","長","宮","志","平","臼","福","黒","溝","田","稲","浅","筒","柳","奧","永","大","冨","林","瀬","大","手","入","篠","福","北","富","矢","小","湯","鶴","沼","高","堀","長","岩","山","大","石","澤","大","石","池","堀","二","相","園","柏","島","奧","平","花","杉","加","村","川","内","片","長","倉","野","河","福","秋","越","西","松","笠","小","田","北","渡","日","谷","千","吉","深","西","相","徳","原","小","米","細","新","田","今","浜","森","畑","小","磯","大","秋","芳","浅","相","坪","細","植","荻","大","白","皆","中",
                "三","福","平","辻","浜","川","島","木","大","塩","河","遠","古","神","中","齊","三","三","大","大","植","難","三","渡","栗","岩","松","井","吉","早","井","長","川","佐","朝","亀","河","川","浜","草","小","堀","保","志","中","尾","半","村","狩","新","水","高","大","高","若","柴","亀","高","立","市","玉","寺","内","三","瀬","武","奈","木","藤","久","植","清","真","玉","深","水","江","大","進","並","守","寺","橋","高","菅","宮","織","藤","河","毛","宮","石","大","矢","市","有","有","下","高","那","鳥","飯","関","松","北","坂","野","板","前","三","川","坂","染","田","立","外","平","岩","松","小","成","三","高","山","長","阪","葛","宇佐","野","滝","秋","長","板","高","塚","小","山","滝","仲","石","高","山","井","長谷","江","海","大","門","椎","和","正","土","中","相","今","都","平","小","藤","細","宍","堀","江","小","岩","木","西","金","諏","金","永","森","田","石","下","金","細","黒","大","大","野","布","小","島","杉","北","小野","梅","山","富","豊","大","上","阿久","赤","石","本","宮","米","末","宮","倉","古","奧","塩","今","麻","仲","菅","風","水","平","香","生","小","坂","大","小","喜","門","西","須","井","大和","中","奧","富","梅","海老","永","浦","矢","佐","岩","杉","砂","川","土","浜","木","木","日","岩","波多","大","長","金","雨","立","羽","小","白","依","浅","平","真","小","石","神","板","目","深","森","山","影","宇田","濱","寺","大","曽","矢","三","松","山","北","高","勝","清","橋","柳","赤","梅","鶴","芦","丹","櫻","瀬","尾","宇都","岩","江","神","横","吉","坂","柳","池","桑","西","久","日比","栗","梅","結","小","西","小","手","大","浦","川","森","飛","井","上","小","田","首","赤","玉","青","横","柏","浅","大","梅","水","小","合","宮","角","有","竹","脇","宮","柴","本","三","島","池","志","明","加","池","春","勝","妹","滝","大","富","大","前","中","会","柿","恩","阪","戸","石","夏","磯","前","益","曽","古","野","笹","小","白","谷","吉","菅","川","国","楠","坂","日下","井","岡","内","持","花","高","熊","金","鬼","神","末","石","福","田","城","玉","倉","田","若","東海","児","塩","粕","沖","寺","森","黒","八","沢","重","寺","高","長","廣","森","本","重","村","大","深","大","高","井","田","鵜","南","知","平","玉","川","磯","菊","米","秋","岡","寺","熊","猪","笹","小","岩","増","畠","古","冨","氏","下","桜","富","長","五","小","野","小","小","大","川","紺","梶","平","土","花","牧","西","安","新","西","鹿","杉","柳","倉","河","小","岩","鹿","相","丸","辻","宮","大","今","長","塚","川","黒","百","安","寺","寺","松","藤","神","寺","赤","我","二","新","篠","益","古","伊","本",
                "東","真","仲","品","滝","室","野","須","大","郡","片","土","村","的","江","平","新","石","神","安","江","中","大","河","南","村","大","渥","金","保","藤","長","久","野","高","湯","照","住","森","長","安","栗","広","赤","大河","河","増","長","河","津","高","伏","船","矢","吉","塩","北","小","仲","相","薄","坪","矢","磯","上","有","松","増","関","石","石","中","藤","金","藤","桑","関","谷","河","緑","八","安","高","浜","梶","尾","照","稲","西","高","垣","山","森","長","湯","棚","牛","二","水","中","福","小","谷","松","住","小宮","迫","相","新","塩","人","小","田","飯","玉","加","鶴","越","船","東","塩","柿","芝","柿","赤","永","深","丸","大","吉","矢","梅","原","清","高","田","下","唐","向","駒","西","井","木","小","辻","高","宇","名","鮫","藤","平","高","三","竹","犬","笹","疋","岩","植","川","磯","西","上","畑","福","福","羽","八","平","加","勝","西","袴","森","金","米","新","船","柳","長","城","志","島","石","廣","村","鳴","横","安","大","伊","沢","山","木","浦","岩","小","村","対","小","大","時","赤","長","早","若","添","衛","庄","川","高","芹","鳥","板","高","伊","小田","宮","深","高","新","保","竹","飯","柳","平","直","小","松","新","丸","徳","大","永","塩","水","谷","桐","米","大","猪","竹","井","国","安","柘","大","野","山","上","山","小","別","赤","日","黒","幸","安","竹","大","岩","須","生","福","熊","猪","大","平","岩","橋","竹","福","赤","柳","藤","青","村","深","須","岩","名","猿","神","早","鳥","石","新","上","熊","矢","小","崎","山","五","上","中","綿","新","小松","松","鎌","春","兵","長","宗","秋","砂","鷲","古","塩","松","石","舟","岩","萩","安","竹","市","間","園","真","鬼","梶","平","関","竹","蛭","荒","藤","広","大","池","二","磯","黒","桜","土","佐","村","竹","岸","安","辰","岡","鳥","犬","東","友","川","一ノ","加賀","高","戸","副","守","大","脇","大","武","馬","堀","清","船","近","元","嶋","井","土","中","菊","米","佐","須","伊","星","田","大","奥","宮","高","片","吉","北","有","海老","若","辻","日","北","多","吉","小田","梶","亀","坪","谷","安","江","杉","山","川","広","春","岡","大","宮","兼","大","箕","大","赤","河","堀","戸","柴","藤","長","設","有","佐","武","細","田","小木","間","深","宮","赤","伊","八","中","田","姫","露","末","寺","片","辻","国","杉","糸","宮","中","北","赤","江","真","曽我","鳥","田","井","牟","小松","若","作","瀬戸","高","藤","横","末","高","古","高","金","末","半","河","草","日","二","吉","深","永","上","角","新","藤","奥","朝","岩","香","梅","白","山","早","石","下","有","折","高","江","速","橋","鷲","佐","稲","永","里","坂",
                "古","野","田","白","西","池","正","石","前","桐","菱","池","錦","上","小田","品","永","沖","坂","猪","井","鍋","中","香","岩","藤","宮","宮","逸","沢","島","小","熊","笹","八重","君","今","矢","湯","江","泉","湯","渕","白","仁","立","宮","大","又","小野","木","本","飯","中","寺","川","野","松","田","宮","高","山","石","三","浅","木","岩","門","成","笹","尾","中","野々","嶋","梅","小","関","松","伊","柳","手","木","大","隅","景","赤","北","菅","具志","福","羽","青","諸","一","羽","木","碓","兵","米","津久","梅","笹","柏","仙","伊","浜","船","北","古","四","河","八","猪","浅","小","大","浦","阪","広","永","鳥","遊","楠","桝","山","桑","溝","常","中","戸","若","中","大","松","丹","山","深","綾","水","一","新","曾","檜","勝","彦","向","別","杉","久","一","岩","春","峯","根","大","能","内","奥","伊","田","奥","立","竹","岸","穂","能","笠","阿","笹","室","小","引","平","押","田","北","朝","北","荒","小","西","上","田","神","柚","瓜","杉","赤","宇","川","津","芦","牛","山","飯","吉","石","諸","椎","三","金","岩","駒","浦","信","国","守","中","桜","櫛","漆","谷","仲","仲","日","前","安","北","田部","寺","栗","新","宮","助","新","菱","宇津","原","城","内","仲","桑","真","木","梶","津","宇佐","熊","陶","柳","中","門","樋","谷","阪","谷","米","勝","清","蓮","今","木","今","高","田","植","安","冨","小谷","青","綿","権","中","深","坂","平","堀","亀","二","比留","横","布","橋","大","荒","白","川","山","大","山","沢","仁","藤","柳","水","粟","北","山","中","堀","涌","中","東","船","広","市","勝","喜","森","東","泉","大","東","中","鈴","松","木","宮","千","水","奥","中","田","坂","高","千","武","牛","津","澤","向","斎","小","真","川","茅","肥","加","稲","新","峰","羽田","魚","松","竹","肥","大","市","古","仁","藤","佐","三田","兼","古","鵜","蜂","臼","大","白","南","増","諸","柿","井","大","本","谷","岡","道","仲","柳","折","笹","甲","平","牛","赤","仲","今","丸","与那","大","加","寺","倉","深","永","野","森","三","仲","桐","坂","浜","花","木","山","荒","清","小野","豊","丹","権","金","武","中","岩","大","井","藤","小","和","大","三","新","沖","白","安","吉","寺","椎","冨","吉","板","宮","関","新","吉","武","徳","河","上","水","野々","芝","大","茨","福","谷","三","笠","佐","江","米","一","安","春","脇","草","嵯","福","稲","川","沖","遠","畑","石","福","西","山","松","野","小","小","南","盛","加","新","長","久保","谷田","衣","溝","祖父","芳","木","西","宮","生","白","戸","古","酒","永","最","中","上","弓","稗","大","熊","浜","梶","岩","畑","外","宮","花","田","草","柏","小野","浅","古","東","深","館","長",
                "樫","今","永","軽","桑","浅","野見","瀬","住","川","田","折","板","熊","四","三","寺","藤","君","葉","古","尾","小","川","右","浦","横","山","谷","奥","越","武","薮","仲","豊","各","根","日","外","友","木","豊","阪","久","宍","利根","新","辰","五月","武","笹","倉","矢","森","三","花","熱","荻","宇","瀬","中","松","成","桧","小田","蔭","可","上","糟","古","坂","片","岸","仲","早","澤","恒","野","串","辺","荘","府","新","福","正","野","曾","北","与那","小","稲","尾","蒔","住","兼","三","江","藤","楢","両","勝","小","池","藤","尾","横","武","金","中","箕","種","宮","藤","磯","越","大","戸","加","衣","浜","堀","鴨","滝","香","綱","東","光","松","小","北","池","小","門","増","渡","上","大","富","北","小","木","久保","大","浅","箱","白","白","羽","稲","山","小","堀","寺","尾","飯","河","土","相","宇","室","番","北","秋","本","馬","浅","近","浜","中","南","竹","岩","蝦","岡","瀬","三","川","木","宮","大","種","丸","細","島","石","戸井","岩","井","森","家","尾","西","瀬","浮","油","出","蔵","中","佐","喜屋","増","真","稲","土","佐","玉","白","寺","成","香","只","掛","新","新","古","樋","畔","北","安","東","岡","蛯","矢","岩","西","広","福","熊","鴇","日","蓮","伊","下","大","穴","国","岩","高","市","原","島","占","黒","辻","斉","八","曽","会","藤","江","永","関","新","十","杉","丸","高","淵","森","伴","西","福","入","寒","平","斎","猪","藤","繁","井","山","矢","濱","喜","清","名","奥","当","野","上","西","広","中","倉","水","吉","木","嶋","宇賀","豊","井","渡","南","吉","永","笹","薬師","須","薮","伊","池","矢","陣","横","猪","武","赤","船","外","溝","神","赤","鷹","豊","朝","徳","鶴","川","茶","深","立","由","当","鳥","若","西","渋","一","籾","長","柴","友","久","花","丸","茂","神","押","米","長","千","仙","田","梶","岡","佐","牧","戸","生","不","谷","本","古","古","天","八木","与","山野","金","網","大","東","山","蒲","城","名","竹","管","尾","前","築","増","光","滑","田","田","黒","本","古","鴫","植","大","戸","白","横","岩","舟","近","百","瀬","濱","播","若","小","興","猿","松","岩","谷","富","植","永","弘","桃","鏑","大","山","川","尾","築","西","庄","宝","伊","城","新","野","今","南","吉","沼","笹","雑","城","春日","松","高","大","脇","田","粟","谷","田","長","徳","秋","蟹","橋","沼","座","光","嘉","花","富","池","森","元","柳","竹","高江","成","倉","田","氏","逢","生田","瀬","中","奧","若","立","伊","新","儀","野","高","笹","寒河","知","西","笹","稲","中","猪","月","青","世","打","海老","中","梅","春","舘","小板","萩","榎","川","堀","池","舟","有","八","横","水","葛","八木","潮","徳","楢",
                "小","白","土","柿","御","知","入","富","沼","越","室","高","猪","長","稲","浅","鬼","武","出","菅","古","戸","竹","沢","宮","纐","橋","増","西","赤","小","南","三","代","高","倉","大","平","黒","濱","横","金","笹","駒","西","小野","浜","加","鴨","糸","花","横","花","白","池","芹","蒲","井","中","尾","池","登","上","花","丸","土","秋","鍛","細","西","森","剣","貝","小","湯","世","新井","秦","西","鶴","石","崎","井","庄","栗","浜","瀧","大","早","滝","辻","張","毛","久","堀","森","西","門","梅","笹","内","瀬","呉","円","佐","伊地","杉","竹","下","亀","山","郡","神","岡","福","出","桃","棚","細","芥","鍋","斉","水","末","稲","梅","檜","杉","萩","谷","五十","香","竹","立","込","黒","吾","橘","川","鎌","芦","浅","久","上","飯","新","久","縄","川","蛯","横","穴","有","砂","財","針","翁","秋","磯","山","矢","宮","戸","糸","美","大","島","渋","干","梅","三","市","磯","元","湯","岩","柄","木","棚","勝","小","中","薗","島","板","高","仙","芝","村","神","石","若","戸","増","小","岩","常","嶋","高","高","山","水","関","浜","苅","蓬","重","荒","楠","紙","国","夏","藤","間","仮","福","淡","安","外","室","安","重","蜂須","間","北","大","上","石","小","一","杉","小","上","糸","星","宮","徳","都","若","貫","玉","小見","角","塩","高見","田","喜多","山","伊","安河","宮","久","出","堂","江","冨","水","横","今","尾","稲","津","上江","横","五","江","菊","椛","津","柴","飯","川","中","国","山","上","道","霜","黒","戸","立","川","新","久保","神","花","大","菅","細","森","入","村","今","樫","二","鴨","沢","守","壁","石","小","蓑","高","楠","植","金","中","兼","阿比","藤","荒","渋","新","赤","吉","上","市","瀧","馬","川","赤","永","藤","桂","横","奈","宮","下","橋","卜","先","有","西","舛","芝","和久","南","打","箭","沼","濱","松","藤","山","下","長","増","八","澁","本","実","安","関","赤","寺","三","桐","安","池","大","高","中","新","満","白","加","水","菅","滝","栗","村","山","油","海","棟","安","高","出","屋","唐","重","国","樽","広","河原","池","羽","沢","桶","本","大","梨","松","小","十","福","宮","草","原","甘","塚","宮","横","田","大","由","入","照","西","古","古","上遠","安","水","片","勝","大","名古","久","大","丸","増","三","三","前","江","下","六","臼","吉","増","勝","金","鯨","浦","都","岩","本","弓","大","綿","粟","一","山","倉","下","関","足","有","井","小","小野","八","酒","直","印","柿","柏","諸","樫","浦","吉","勝間","水","種","森","山","新","森","玉","天","広","飯","川","伊","東","鮎","岡","大","畔","中","金","幡","平","末","柿","峯","牧","菰","上","西","豊","美","石","大","生","魚","蔵","熊",
                "力","周","国府","小","大","戸","江","榎","阪","門","多","駒","中","鐘ケ","市","倉","今","蛭","吉","池","三","大","橘","公","水","田","上","永","篠","紅","榛","御","三","海老","船","京","隈","桧","片","大","森","行","長","刀","本","光","小","有","吉","海老","大","東","赤","桝","徳","花","小橋","石","井","戸","浦","吉","沢","田","椎","津","中","西","薦","折","塩","有","武","西","藤","堅","市","鵜","島","倉","深","古","岡","藤","箱","五木","尾","桑","江","神","簗","多","三","森","谷","久","神","反","稲","髙","池ケ","若","松","小","渡","庭","小田","広","郷","古","大","田","小","幸","谷","北","土","寺","喜友","津","国","駒","大","栃","戸","阿","間","重","神","古","執","仲","仲","東","鹿","吹","川","羽","安","薮","立","羽根","滝","石","穴","針","漆","荒","坂","新","上","西","酒","醍","澤","檀","本","中","加","黒","田","篠","東","高","国","池","押","池","三","指","福","宗","千","千","初","高","半","五","葛","藤","大","泉","竹","江波","志","城","菱","桂","日","村","深","寺","神","永","諏訪","安","建","三","出","井","野","金","大","久","酒","昆","桝","弘","嘉","滝","塚","鍋","澤","溝","出","相","蓮","瀬戸","前","丹","加賀","飯","押","万","土","三","高","上","白","寺","金","勝","島","猪","南","古","永","今","溝","仲","南","堀","崎","安","東","橘","浅","村","川","平","堂","四","子","嘉","花","諸","浜","稲","唐","薄","和","江","菊","古","功","今","戸","松","古","桜","柏","永","森","木","市","持","貝","羽","南","小","桝","千代","天","三","稲","天","坂","峯","元","長","国","牧","輿","百","貝","紺","阿","東","帆","藁","中","木","崎","上","興","秀","洞","綱","角","寺","渡慶","島","平","武","宮","樺","屋","郷","谷","小","鴨","額","小野","岡","酒","井","青","波多","宗","北","神","渡","刈","福","小","豊","小","滝","塩","宮","糸","冨","鵜","横","梶","中津","小森","信","沼","奥","保","矢田","蓮","外","南","重","下","中","沼","京","江","東","風","西","秋","樋","坂","成","友","上野","刑","野","根","川","広","出","貝","大","中","小","師","宮","安","里","楠","愛","納","林","光","奥","伊","竹","海","大","樋","森","花","川","鵜","土","池","北","境","大曽","山","住","友","明","東","三ツ","田","江","日向","三重","二","金","今","真","陰","米","真","大","西","中","稲","久","土","笠","田","相","礒","西","羽","勝","笛","永","生","仲","泉","竹","峰","元","徳","湯","日","甲斐","朝","薗","久","徳","富","中","橋","真","大","当","山","藤","白","和久","玉","藤","鹿","村","井","沖","蒲","真","名","長","大","芝","重","松","海老","九","古","森","栗","宮","堂","小","新","荻","藤","井","江","狩","石","永","黒","小柳","降","木","大","飯","戸","三","高比",
                "須","渡嘉","池","三","光","冨","貴","下","伊","野","沢","成","上久","池","勅使","波田","山","永","中","岡","戸","湯","上","豊","前","蜷","小","仲","小田","古","南","川","由","浜","古","芳","根","友","三","樽","広","森","志","鶴","井手","中","園","足","山野","中","明","得","梁","前","幸","遠","池","当","三","配","廣","吉","永","野","川","麻","尾","藤","半","富","井","染","二ノ","倉","末","武","北","鬼","尾","宇","笠","館","生","宇","金","澄","徳","大","赤","鷹","石","瀬","田","小","伊","坂","天","黒","久木","後","片","宮","田","萩","内","我那","高","小","徳","入","芦","小此","穂","軍","吉","金","染","水","和","近","屋","杉","山","嶋","増","茂","上","目","藁","浦","池","安","浜","貴","原","峰","仲","森","中","増","笠","親","壱","友","川","町","森","下","蓑","三","津波","飯","玉","浜","重","袖","横","坪","蓜","黒","礒","相","村","瀬","今","延","尾","鷲","成","釜","安","村","市","山","引","清","坪","瀧","浦","一","乙","村","桑","駒","鳥谷","海","鈴","上","下","室","光","倉","榎","百","三","馬","釘","櫛","下","米","坂","茂","桑","亀","引","桜","関","佐","宮","有","羽","矢","丹","葛","賀","中","芦","円","俣","西","川","黒","泉","網","納","大根","若","角","仁","来","沢","洲","安","芹","瀧","古","行","丸","扇","芝","岡","蛭","野","見","粟飯","屋","光","酒","榎","国","田","茅","藤","渡","弥","図","栗","稲","高","天","布","笹","岩","林","砂","阿久","久","網","沼","狭","松","下","押","横","那須","藤","海","藤","是","芹","松","井","多賀","是","作","伏","角","岩","木","安","蒲","河","仁","三","新","長","赤","槙","小田","星","朝","谷","射","藤","萩","梶","天","有","谷","加治","福","成","新","吉","萱","伊","池","米","丸","笹","江","梁","八","伊与","塩","国","秋","門","久保","宿","小野","清","花","和","中野","辰","穴","垣","露","古","木","平","外","米","浦","見","島","高","野","釜","仲村","逆","朝","矢","入","板","塩","入","稲","蓑","立","奥","千","柳","塩","三","進","稲","松","安","堀","肥","馬","河","山","長久","草","青","芦","蒲","勝","鹿","城","高根","作","有","積","吉","椎","江","伊勢","児","美濃","坪","地","柴","多々","渋","有","貴","吉","高草","七","鈴","苅","川","徳","升","武","永","末","布","屋比","伊","日","細","野々","木佐","諫","竹","細","原","植","西","児","末","草","町","原","釼","奈良","隈","坪","和","三","重","滝","塩","角","菊","徳","羽","竹","常","川","徳","友","垣","二","境","左","高","椎","可","矢","奥","広","元","岩","宇","浜","牧","北","花","恒","北","牛","岡","溝","染","降","丹","板","須","赤","前","寺","鷲","御園","大","武","在","嘉","沖","乗","城","三","茶","北","本","永","寺","黒","鎗","山","松","芳","伊集","小金",
                "伊","下","田井","安","神","安","奥","有","奥","長","清","楠","鶴","国","黒","峰","大","八","玉","坂","鍵","沓","輿","重","川","波","粉","牛","鯉","高","名","交","浪","堀","坂","今","昼","岡","西","中","松","白","稲","皆","久","椿","千","真","関","十","時","臼","苅","高","江","矢ケ","大","佐久","木","大田","新","嶺","南","杉","御","朝","牧","晴","滝","勝","糸","阿","光","江","井","車","倉","徳","永","竹","久","北","野","峯","河原","大内","力","牛","八木","池","秋","西","末","越","中","西","二本","樫","田","大","前","行","徳","鹿","二","清","桐","上","笹","塩","奥","国","久","鍵","松","長","溝","家","星","並","正","大","真栄","塩","神","保","池","久","加","内","森","村","中","大","室","秋","竹","梅","樋","平","浅","槙","馬","下","出","柳","庭","當","高","竹ノ","白","正","伊佐","森","椋","吉","鎌","霜","柿","高","柏","石","新","宇","小","跡","長","徳","鴻","駒","島","堀","苗","朝","三ツ","田","阿久","古","有","水","西牟","南","小","江","畠","礒","菊","本","小佐","茅","薮","中","倉","増","吉","徳","小","岩","番","水","岩","小","黒","鹿","長","吉","大","浪","吾","恒","水","吉","尾","山","金","成","川","赤","五","片","大","土","棚","尾","坂","小","新","銘","近","小","浦","大川","楠","大多","横","小野","小金","水戸","伊","金","森","柴","伝","鈴","犬","飯","松","津","高","一","寺","新","尾","鳥","桑","福","城","石","黒","中","鴨","小","井之","櫻","樋","津","平","坂井","今","辻","脇","大","武","山","赤","尾","槙","竜","鳥","近","大","岩","内","瓜","原","垂","石","今","四","河","野","鎌","守","亀","長","三","片","作","波","熱","青","早","小岩","木","米","米","井","向","与","門","則","高","諌","姉","前","道","円","丸","道","向","知","大日","椛","利","本","倉","千","阿","宗","大","上","伊","船","沓","小坂","嶋","大","越","河","亀","竹","酒","佐","下","加々","菖","阿","具","笈","浅","枝","蓼","重","増","北","佐","福","竹","赤","武","須","阪","安","山","小","石戸","久","額","四方","舟","新","佐久","伊","柳","武","銭","宅","中","熊","苫米","名","椙","八","江里","奥","幸","後","江","大","杉","謝","山","小","常","津","中曽","川","小野","小","山","重","後藤","上","中","野","高","牧","久","武","石","永","金","尾","千","長","堀","吉","余","江","松","藤","南","古","鬼","嘉","匂","和","源","木","八木","福","下山","肥","高","西","津嘉","山","杉","三","合","小","内","真","角","税","成","尾","酒","金","当","米","大","出","宜","北","矢","平","麻","玉","手代","諏","粥","北","岡","茂手","幕","榎","瑞慶","国","網","和","広","兼","中","牛","前","石","新","深","敦","浅","村","犬","越","磯","壬","狩","川","下","森","殿","生","橘","船","岩","政","飯","尾","大",
                "萩野","守","余","安谷","廣","岸","井手","泉","副","飯","常世","井戸","寺","白","城","白","小石","渋","前","菅","竹","畑","虻","川","崎","永","倉","炭","若","樽","松","押","沓","豊","七","鹿","岡","神","佐","平","六本","門","竹","松","才","古","大","澤","平","平","根","長","海江","折","冨","水","玉","木戸","中","西","荒","中牟","石郷","本","安","田名","清","田","勝","久","本","天","藤","寺","絹","名嘉","倉","井","津","吉","丸","重","泉","時","桐","並","本","朽","名","鷲","伊","渋","田名","田","大","松","小野","小松","大曾","佐","本","国","中","猪","石","三","小長","穐","阿","溝","大","有","来","本","安","壷","伊","石","里","古","二","永","真栄","田","野","温","永","熊","初","勝","小","出","桐","下","中","細","八","沖","右","菊","笠","若","曽根","三","弓","篠","加藤","森","桶","福","濱","古","井","武","星","栗","辛","平","鶴","唐","太刀","天","豊","能","桒","米","蕪","牧","湯","宇都","但","紀","瀬","久","真","茂","久","田","二","塩野","坂","廣","向","塩","我如","吉","橋","塩","五十","波","永","政","長","矢ケ","仁","小田","鋤","武","富","徳","坂","西","神","木","村","浅","早","近","尾","藤","奥","一","鶴","矢","時","御子","饗","竹","垣","星","梶","原","畑","加","坪","藪","花","力","宇","阿知","秋田","上","関","朝","春","栗","榑","七","小金","財","坂","海","永","須","財","久","末","門","岩","久","粂","北","勝","森","鮎","丹","藪","柿","広","日野","鷲","会","當","名","山","良","富","福","見","平","保","間","三","岩","下","比屋","志","長","地","佐々","長谷","栃","芦","三","岩","辻","坂","上","布","水","蓮","井","小","十","大","片","根","剱","鹿","栄","川野","大","諸見","山","船","渡","稲","社","位","広","真","運","井","飯","高","出","忍","岸","芳","早","伊","羽","庭","下","甲","行","星","黒","山","小","鍵","佐","真","三","進","稲","松","安","堀","肥","馬","河","山","長久","草","青","芦","蒲","勝","鹿","城","高根","作","有","積","吉","椎","江","伊勢","児","美濃","坪","地","柴","多々","渋","有","貴","吉","高草","七","鈴","苅","川","徳","升","武","永","末","布","屋比","伊","日","細","野々","木佐","諫","竹","細","原","植","西","児","末","草","町","原","釼","奈良","隈","坪","和","三","重","滝","塩","角","菊","徳","羽","竹","常","川","徳","友","垣","二","境","左","高","椎","可","矢","奥","広","元","岩","宇","浜","牧","北","花","恒","北","牛","岡","溝","染","降","丹","板","須","赤","前","寺","鷲","御園","大","武","在","嘉","沖","乗","城","三","茶","北","本","永","寺","黒","鎗","山","松","芳","伊集","小金","宮","伊","下","田井","安","神","安","奥","有","奥","長","清","楠","鶴","国","黒","峰","大","八","玉","坂","鍵","沓","輿","重","川","波","粉","牛","鯉","高","名",
                "佐","浪","堀","坂","今","昼","岡","西","中","松","白","稲","皆","久","椿","千","真","関","十文","時","臼","苅","高","江","矢ケ","大","佐久","木","大田","新","嶺","南","杉","御","朝","牧","晴","滝","勝","糸","阿","光","江","井","車","倉","徳","永","竹","久","北","野","峯","河原","大内","力","牛","八木","池","秋","西","末","越","中","西","二本","樫","田","大","前","行","徳","鹿","二","清","桐","上","笹","塩","奥","国","久","鍵","松","長","溝","家","星","並","正","大","真栄","塩","神","保","池","久","加","内","森","村","中","大","室","秋","竹","梅","樋","平","浅","槙","馬","下","出","柳","庭","當","高","竹","白","正","伊佐","森","椋","吉","鎌","霜","柿","高","柏","石","新","宇","小","跡","長","徳","鴻","駒","島","堀","苗","朝","三ツ","田","阿久","古","有","水","西牟","南","小","江","畠","礒","菊","本","小佐","茅","薮","中","倉","増","吉","徳","小","岩","番","水","岩","小","黒","鹿","長","吉","大","浪","吾","恒","水","吉","尾","山","金","成","川","赤","五反","片","大","土","棚","尾","坂","小","新","銘","近","小","浦","大川","楠","大多","横","小野","小金","水戸","伊","金","森","柴","伝","鈴","犬","飯","松","津","高","一","寺","新","尾","鳥","桑","福","城","石","黒","中","鴨","小","井之","櫻","樋","津","平","坂井","今","辻","脇","大","武","山","赤","尾","槙","竜","鳥","近","大","岩","内","瓜","原","垂","石","今","四","河","野","鎌","守","亀","長","三","片","作","波","熱","青","早","小岩","木","米","米","井","向","与","門","則","高","諌","姉","前","道","円","丸","道","向","知","大","椛","利","本","倉","千","阿","宗","大","上","伊","船","沓","小坂","嶋","大","越","河","亀"],
    "last_2b":["藤","木","橋","中","藤","辺","本","村","林","藤","田","田","木","口","本","上","村","藤","水","崎","田","本","部","川","下","島","井","川","田","田","川","田","藤","藤","上","藤","木","本","藤","田","田","村","井","子","本","原","野","浦","田","川","田","内","野","村","山","田","田","田","田","田","田","井","崎","山","木","藤","本","野","島","口","井","藤","田","田","山","山","田","塚","井","山","野","本","野","野","口","田","井","葉","崎","原","下","保","野","村","尾","川","地","本","川","田","西","野","井","野","川","部","内","田","田","池","川","松","村","田","嵐","口","田","田","田","部","田","屋","崎","島","田","口","山","井","口","中","西","村","上","原","橋","岡","場","田","本","野","野","野","久保","下","池","岡","田","木","谷","藤","浦","谷","田","崎","田","月","村","辺","井","村","島","川","井","原","野","山","瀬","田","橋","原","本","山","口","田","石","山","野","間","藤","崎","田","東","田","原","原","西","原","井","賀","泉","森","田","村","山","島","田","原","宅","岡","浦","田","木","田","沢","永","川","根","合","山","野","石","村","田","山","尾","倉","谷","村","寺","山","立","村","口","野","田","久間","本","田","島","塚","田","山","藤","井","田","下","本","本","谷","田","谷","玉","井","藤","井","原","部","下","田","原","井","田","村","川","垣","川","川","崎","田","林","島","沢","塚","部","内","川","代","嶋","口","根","谷","本","川","多","尾","山","野","井","川","野","田","葉","達","田","川","合","井","松","田","上","山","井","尾","原","崎","沢","田","田","山","田","田","野","好","岸","伯","川","岡","竹","斐","木","原","江","田","永","田","木","川","田","原","田","田","木","中","城","井","城","山","田","沢","村","端","口","原","場","城","嘉","島","原","内","沢","井","司","内","木","野","高","島","井","田","田","黒","本","野","中","田","田","田","川","本","野","野","野","原","羽","川","谷","柳","本","岡","下","本","谷","方","村","川","井","島","輪","崎","沢","田","原","岸","井","村","瀬","村","本","沢","澤","井","沢","口","井","森","村","野","沢","村","松","井","岡","沢","口","原","田","田","井","田","村","野","原","田","田","戸","平","塚","江","田","永","原","永","島","出","浅","田","田","松","口","岡","瀬","岡","田","崎","田","槻","山","上","川","宮","馬","田","木","崎","田","岡","田","原","納","瀬","野","海","桐","沢","田","沢","原","原","元","智","原","野","井","坂","畑","島","邊","野","本","田","井","沢","沢","沢","田","口","柳","山","谷","谷","上","泉","野","岡","中","嶋","部","井","田","賀","見","原","井","田","木","原","崎","川","川","本",
                "谷","山","林","本","口","瀬","村","原","友","田","内","山","屋","山","里","藤","橋","井","澤","坪","村","波","村","邉","山","下","川","手","永","坂","出","井","畑","竹","倉","山","田","合","崎","野","宮","井","坂","賀","根","形","田","岡","野","垣","上","村","津","柳","松","崎","田","岡","石","村","城","島","野","島","川","内","良","内","崎","野","松","野","鍋","井","谷","口","藤","沼","藤","木","屋","本","口","見","谷","地","田","森","本","利","島","渡","江","部","原","馬","田","山","原","須","居","野","谷","沢","山","下","上","垣","原","原","井","上","谷","崎","花","山","尾","佐","木","室","瀬","田","尾","城","谷","本","西","美","本","本","葉","瀬","倉","崎","原","寺","﨑","口","村","垣","梨","野","田","部","崎","野","倉","脇","名","泉","木","居","澤","川","田","築","塚","関","木","井","戸","越","川","杉","永","田","谷","谷","訪","山","山","谷","川","丸","川","森","野","岩","熊","貫","原","施","畑","袋","村","田","田","原","上","樫","島","矢","山","津","松","本","橋","脇","沢","永","野","持","沢","野","谷","西","生","田","沼","間","田","良","川","田","幡","元","庭","久保","多","田","口","賀","川","田","林","山","岡","本","原","島","田","口","川","間","野","川","辺","橋","本","本","戸","下","渕","野","滝","崎","丸","宮","川","田","沼","鳥","田","川","沢","田","椋","坂","崎","橋","黒","田","脇","形","山","川","田","尾","畑","根","田","枝","元","元","沢","倉","又","田","爪","川","木","津","岡","田","野","井","尾","上","宮","城","原","野","尾","澤","野","原","内","田","脇","米","野","林","村","城","堀","島","菅","島","嶋","野","西","口","田","原","杉","高","端","藤","坂","置","野","川","原","沼","林","沢","島","玉","田","坂","谷","賀","原","田","里","山","村","沢","津","本","田","石","瀬","谷","日","田","尾","川","和","山","下","島","塚","田","沼","田","口","塚","野","目","野","野","田","我","山","島","川","栗","木","村","崎","井","越","分","本","東","部","本","山","村","田","岡","畑","田","澤","頭","戸","吉","倉","地","渕","戸","木","本","所","山","林","島","見","谷","田","沢","井","崎","田","井","松","西","嶋","坂","瀬","永","山","田","木","浦","井","高","谷","村","尻","飼","部","念","賀","田","嶋","崎","田","倉","本","島","岡","倉","股","原","俣","谷","井","中","橋","永","家","地","田","沢","浜","味","口","呂","暮","平","関","添","野","田","本","谷","井","田","井","永","村","浦","島","崎","瀬","橋","西","峰","村","野","田","田","村","澤","越","川","沼","越","名","澤","瀬","川","内","崎","谷","島","原","井","羽","妻","瓶","保","塚","子","市","達","郷",
                "野","野","野","川","田","井","間","永","前","司","野","肥","越","場","田","原","川","沢","保","西","頭","岡","宮","上","雲","中","岩","美","原","田","山","澤","田","尻","須","川","井","田","島","友","原","本","川","井","原","口","山","嶋","崎","村","津","見","越","吹","見","崎","岡","山田","宗根","良","井","田","崎","貝","岡","村","橋","子","本","岡","村","森","谷","野","巻","野","野","田","井","川","巻","東","沢","中","山","関","屋","村","森","坂","内","脇","崎","山","本","橋","島","村","本","道","士","村","内","林","吉","山","田","澤","美","野","見","竹","嶋","村","川","賀","見","川","木","山","沢","本","田","崎","塚","瀬","澤","岡","坂","武","沢","木","島","原","森","沢","野","沢","山","井","澤","沢","島","橋","井","杉","田","倉","島","澤","間","林","瓶","林","飼","本","田","沢","野","内","田","崎","地","山","沢","元","鳥","幡","石","茂","山","垣","田","野","本","谷","里","橋","澤","屋","間","水","本","毛","田","尾","海","溝","斎","屋","沢","村","浦","谷","川","橋","崎","本","馬","熊","杉","田","堀","嶺","瀬","杉","田","藤","子","又","久","沢","海","谷","塚","勢","島","村","川","本","藤","科","山","沼","井","岩","井","山内","葉","城","尾","山","迫","松","川","越","山","山","村","須賀","俣","島","戸","井","岡","植","上","澤","路","林","谷","浜","府","間","向","瀬","田","江","之内","河内","野","崎","駒","嶋","野","狩","泉","島","見","詰","井","留","嶺","沼","江","島","川","見","貝","元","取","渡","尾","田","越","上","山","西","本","作","塚","山","西","島","島","平","貫","倉","崎","澤","倉","田","頭","江","像","吉","田","見","澤","原","坂","津","橋","切","野","本","谷","橋","瀬","部","下","塚","谷","木","川","川","田","谷","枝","岡","岡","野","階堂","村","須","庭","岐","原","野","沢","野","倍","巳","林","羽","塚","田","田","尻","瀬","谷","石","村","島","田","堀","坂","賀","山","渕","尾","家","津","江","木","崎","坂","方","園","川","川","山","山","波","川","丸","里","谷","嶋","城","倉","松","条","吉","沢","月","野","置","口","賀","成","切","川","谷","内","岡","里","本","谷","地","北","沢","山","安","本","武","子","門","輪","脇","沢","辺","部","谷","原","倉","内","楽","本","田","石","見","山","曽","宮","津","尾","尾","原","島","込","坂","野","木","広","山","平","田","吉","江","井","﨑","江","浦","石","上","壁","部","山","淵","関","田","原","井","田","口","宮","間","内","松","垣","野","良","川","次","沢","津","間","比","見","良","山","尾","条","野","居","平","原","日","上","取","野","田","室","野","神","平","川","原","畠","尻","水","田","尾","瀬","川","吉","見","根",
                "家","坂","井","土","出","原","田","森","山","生","沼","永","織","坂","原","田","岡","野","巻","野","野","島","崎","月","倉","代","部","前","見","口","野","柴","崎","田","樫","島","岡","内","沢","島","谷","田","上","岩","科","野","永","道","吉","塚","崎","庄","尾","瀬","嶋","久保","瀬","藤","野","岡","桑","際","島","角","岡","山","﨑","馬","沢","岡","田","垣","村","村","崎","黒","戸","丸","佐","本","嶋","暮","月","田","山","池","林","田","堅","村","生","田","岡","瀬","賀","元","井","藤","澤","井","澤","井","崎","波","丹","島","山","尾","瀬","方","島","代","瀬","利","河","浜","上","田","野","谷","井","佐","田","田","木","山","上","盤","橋","川","狭","元","垣","倉","治","添","瀬","部","戸","戸","妻","根","山","野","坂","後","所","岡","我","色","淵","名","岸","津","串","勢","川","平","賀","沼","井","山","野","川","積","登","松","南","木","田","牧","地","澤","田","仲","本","比奈","條","巻","早川","嶋","川","部","林","木","生","森","川","井","﨑","島","沢","田","名","山","住","谷","橋","葉","澤","光","尾","田","山","田","本","谷","条","木","田","原","中","間","本","吉","沢","保","井","井","門","栖","海","井","川","野","田","木","野","田","堀","川","名","島","場","本","川","見","木","山","谷","辻","間","渡","崎","上","野","本","俣","川","見","枝","野","津","安","宮","竹","野","岡","野","井","引","田","上","野","内","出","之内","岡","木","間","沢","川","場","隅","田","浜","俣","辺","町","之内","野","平","永","下","村","野","澤","越","居","本","井","津","条","田","井","野","部","田","内","谷","田","出","郷","畑","村","平","幡","口","原","落","本","條","頭","部","浜","野","本","山","野","井","田","木","貫","木","岸","野","田","地","見","堀","岸","野","住","宮","森","後","東","田","木","木","城","々","村","田","本","沢","谷","田","藤","水","野","本","星","原","内","窪","木","沢","元","下","谷","生","田","山","田","沼","尾","星","井","関","谷","嶺","畠","来","村","島","町","原","地","元","野","里","原","倉","村","房","口","森","牧","宮","沢","岡","下","藤","崎","村","屋","川","池","藤","尾","滝","気","黒","森","家","本","崎","武","富","川","野","山","山","東","木","田","開","元","市","丸","端","間","沢","山","崎","家","木","崎","津","嶋","間","古","村","原","柳","村","木","本","場","峨","間","本","中","山","田","野","松","富","内","県","嶋","津","岩","路","川","田","島","屋","倉","木","部","川","渕","江","野","藤","條","腰","井","坂","沢","閑","巻","江","上","出","條","削","田","口","坂","岡","野","澤","田","間","越","村","岡","薙","倉","瀬","倉","井","條","尾","野","塚",
                "村","中","沢","部","島","香","山","田","谷","元","内","笠","井","井","宮","戸","下","林","塚","山","林","島","南","下","田","崎","江","尾","藤","津","田","部","内","山","永","務","来","暮","川","利","全","川","井","世","倉","川","宅","己","女","川","野","林","嶋","村","品","木","田","田","都","谷","間","枝","川","垣","桐","山","児","谷","谷","畑","入","田","上","西","乙女","村","川","元","田","見","司","川","原","谷","岡","川","我","見","覇","笹","岡","花","田","友","松","国","森","沼","崎","角","見","針","沢","波","山","手","智","岡","内","浦","村","平","吉","谷","野","角","高","古","笠","谷","切","志田","澤","山","島","川","田","江","畠","出","辺","磯","倉","渕","瀬","松","渕","澤","嶋","河原","曽","山","室","尾","崎","沢","倉","山","吉","家","形","野","坂","藤","泉","瀬","本","場","山","谷","場","谷","月","城","渡","原","田","川","丸","谷","尾","木","名","沢","野","崎","満","津","西","北","田","井","江","谷","澤","田","原","澤","沢","田","野","条","口","田","井","井","本","浜","賀","武","永","崎","毛","山","治","村","戸","澤","島","西","野","川","名","宮","庄","田","柳","崎","孫子","原","井","名","代","月","塚","島","西","澤","田","浦","沼","澤","里","戸","井","枝","松","澤","岡","山","貫","部","柳","川","木","尋","田","沢","堂","沢","沼","山","島","河","沢","本","岸","上","重","野","畑","森","沢","川","瀬","田","又","元","田","筒","北","澤","口","納","藤","和","川","山","木","本","中","木","神","内","沼","留","川","津","神","福","元","会","出","江","見","島","寺","川","田","奈","端","萩","内","地","原","居","津","戸","崎","田","村","崎","野","嶋","田","重","巻","勝","谷","堀","松","井","間","飼","尾","坂","沢","木","山","橋","野","野","富","島","橋","呂","藤","川","津","峰","賀","田","尾","浦","﨑","橋","原","部","野","破","井","宮","内","城","田","橋","儀","井","村","野","塩","出","梨","生","野","越","岡","野","﨑","村","地","淵","永","川","浦","谷","坂","吉","藤","原","原","神","崎","神","谷","根","木","野","田","下","崎","磨","菜","峯","梠","田","波","波","脇","井","草","嶋","中","井","木","中","科","戸","方","山","部","野","田","井","山","見","辺","福","波","谷","沢","森","賀","所","井","森","根","隈","山","子","田","島","邊","原","本","谷","江","村","尻","間","岡","数","城","塚","尻","藤","田","橋","崎","洲","松","地","平","原","坂","目","古","鉢","平","生","木","吹","沼","間","末","藤","倉","江","花","方","谷","生","武","口","岡","沼","古","越","名","矢","谷","原","野","橋","尾","田","津","池","村","山","山","尾","倉","嶋","原","沢","田","留","原",
                "石","根","門","木","手洗","久","山","川","倉","後","伏","口","飼","南","富","賀","沢","富","水","沢","村","松","澤","木","園","纈","野","岡","海","田","向","里","宮","田","間","沢","嶺","子","沼","野","瀬","内","尾","形","郷","里","地","川","下","川","輪","塚","本","山","崎","澤","原","谷","越","川","口","坂","妻","沢","野","佐","野","治","貝","元","木","持","塚","園","山","良","田","野","平","谷","飛","田","下","田","城","辺","澤","金","崎","野","岡","替","塚","下","場","上","林","井","林","沼","間","崎","屋","谷","渡","知","下","花","条","川","沢","山","宮","嶋","家","原","原","田","木","川","田","田","間","田","井","山","垣","井","谷","垣","川","田","口","原","山","野","妻","田","鍋","形","川","海","原","月","岡","木","永","田","手","原","堀","沢","坂","原","津","谷","長","庭","山","部","倉","森","張","数","馬","蔵","岡","田","場","川","塚","来","辺","山","原","山","沢","部","原","木","中","馬","田","根","野","部","石","原","崎","代","見","原","島","川","長谷","堀","田","本","取","下","里","原","沢","名","谷","田","野","尾","木","谷","広","井","浪","野","屋","澤","路","間","村","岡","斉","村","賀","中","爪","八木","中","堂","阪","宮","尾","清水","里","賀","山","元","原","筑","宮","井","野","山","井","澤","沢","邉","村","藤","田","内","路","住","村","本","端","樫","木","島","里","高","森","崎","洲","須賀","藤","幡","谷","島","山","垣","嶋","浪","台","武","賀","嶋","上","田","石","倉","田","澄","庄","寺","長","谷","園","生","矢","屋","口","島","城","本","川","川","辺","山","谷","戸","浦","田","屋","原","山","木","筋","平","留","生","瀬","川","津","城","浦","平","瀬","本","越","部","沼","石","丸","川","関","須","谷","岡","元","部","崎","沢","堀","田","野","井","條","田","内","尾","本","戸","中","縣","島","村","尾","鍬","谷","川","川","富","原","瀬","口","石","谷","楽","山","嶽","平","家","崎","田","幡","治","津","家","井","木","石","道","谷","藤","方","島","階","田","代","木","本","松","井","中","崎","戸","根","崎","谷","谷","住","本","隈","尾","川","重","良","刈","沢","利","崎","林","野","久保","羽","良","谷","沼","宮","舘","里","野","宅","井","寄","村","瀬","屋","本","地","茂","野","吉","富","畑","畑","谷","車","杵","池","沢","亦","坂","井","部","丸","岡","島","場","類","谷","津","条","井","岡","原","屋","達","働","ノ口","城","崎","谷","匂","江","南","田","谷","田","原","島","森","田","川","市","原","原","納","戸","那覇","羽","畑","高","路","礼","口","川","戸","松","上","口","成","野","嶋","岡","沢","村","山","田","垣","上","原","濃","河","淵","島","谷","田","川",
                "石","藤","田","塩","辻","井","見","戸","野","野","胡","崎","務","江","毛","知","林","川","橋","島","尾","河","高","文","元","窪","出","友","宮","林","葉","園","代","根","本","谷","元","山","柳","川原","園","方","縄","根","岡","山","枝","泉","水","澤","柳","本","澤","井","岡","崎","川","関","崎","辺","本","尾","本","巻","木","曲","司","久保","田","戸","入","井","政","城","嶋","田","場","川","川","谷","水","宮","庭","塚","田","田","本","村","連","津","瀬","和田","山","安","合","家","部","町","木","橋","谷","木","久","瀬","久地","野","部","谷","原","館","見","場","国","地","澤","畠","川","谷","名","留","田","場","日方","木","嶋","保","島","岡","永","池","行","地","原","島","内","田","地","柴","食","下","岩","田","上","部","田","生","畑","金","崎","岡","木","牧","向","醐","口","上","沢","安","山","島","路","木","江","月","友","下","切","川","須","田","川","形","代","島","田","須賀","澤","嶋","城","瀬","武","川","元","戸","摩","下","川","田","笠","沢","江","地","吉","塚","部","福","部","本","雲","尻","添","尾","薮","慈","見","野","谷","田","藤","下","野","谷","野","部","川","羽","池","山","嶋","波","美","干","野","代","師","河","地","甲","谷","前","杉","本","内","熊","条","郡","倉","橋","端","島","沢","米","浜","彦","村","川","山","林","渕","戸","前","元","安","村","野","井","松","場","澤","田","知","戸","本","関","刀","成","上","﨑","河","沢","田","森","尾","寺","丸","丸","原","場","口","見","本","田","川","川","山","谷","西","田","村","門","島","村","石","武","沼","谷","曽","浦","足","谷","前","嶋","原","園","津","島","口","川","川","脇","次","倉","谷","笠","代","沢","良","田","上","木","田","賀","木","原","本","浦","砥","江","田","垣","沢","井","谷","住","方","崎","日向","島","塚","入","山","澤","澤","浜","村","川","谷","太","野","西","谷","部","井","園","山","信","坂","藤","崎","極","澤","城","見","藤","場","川","爪","澤","松","山","部","宮","木","原田","江","野","瀬","鹿","路","湊","岡","浦","積","村","瀬","甲","谷","原","本","沢","野","上","津","草","上","部","柳","人","野","江","松","脇","野","根","戸","本","永","神","海","木","熊","間","野","野","神","高","本","弓","山","満","柄","館","園","川原","福","島","生","島","本","楽","部","江","石","呂","木","富","沼","松","水","腰","松","吉","井","澤","原","田","野","部","高","島","安","城","川","砂","成","麻","瀬","居","須","田","山","下","田","橋","伊","村","田","部","嘉","畑","重","本","森","浪","沼","鬼","堅","中","崎","山","園","堺","本","島","内","岡","良","俣","綿","峰","部","津","旗","沢","藪","沢","澤","根","良",
                "原","敷","亀","坂","井","沢","田","條","庭","畑","山","毛","保","畑","河原","野","平","澤","溝","松","口","口","井","泉","澤","川","鹿","沢","嶋","江","田","副","利","井","矢","村","間","部","船","見","部","泉","岐","崎","口","北","山","利","辺","倉","田","能","瀬","橋","野","矢","間","真","留","島","川","竹","坂","内","平","田","沢","橋","谷","松","山","野","宮","光","武","者","中","木","原","治","木","山","川","高","久保","川","光","宅","岩","取","浜","山","之上","須田","部","梨","沼","滝","田","田","瀬","国","添","田","木","覇","萩","渕","武","野","野","木","坂","司","中","指","矢","澤","久","沢","宜","木","端","野","村","野","森","崎","科","井","澤","立","砂","志","川","尾","尾","嶋","下","谷","谷","川","岐","寄","谷","野","光","沢","島","瀬","古","森","利","元","富","山","森","倉","島","井","野","内","下","沼","吉","原","畑","野","清","田","住","口","山","畑","間","瀬","根","川","辺","條","部","元","畑","沢","部","保","江","口","元","屋","安","重","並","々","苫","上","宮","引","西","良","尾","田","本","崎","田","本","塚","倉","寺","岡","原","木","沢","谷","川","桐","原","山","野","浜","東","河","山","谷","富","田","槻","南","田","栖","谷","崎","松","川","口","俣","田","川","谷","山","谷","間","﨑","上","原","敷","武","田","木","安","倉","根","松","口","永","師","野","嶺","市","満","目","生","坂","崎","山","根","山","代","口","間","石","出","尾","道","野","浦","田","戸","枝","田","延","島","谷","永","本","木","屋","島","俣","芸","池","部","藤","神","地","堀","司","野","川","田","井","原","場","掛","本","井","本","木","地","屋","光","井","関","木","野","能","部","須","子","部","草","川","坂","田","月","沢","永","口","井","谷","原","沢","澤","賀","渡","野","見","本","崎","謝","庭","手","岡","井","谷","目","尻","川","平","谷","渠","井","岡","後","倉","津","島","澤","沢","輪","岡","間","明","内","津","堀","士","熊","前","中","込","沼","淵","北","手","保","川","谷","澤","谷","間","毛","本","沢","山","松","田","越","原","坂","田","山","部","川","引","谷","良","井","元","島","冨","木","海","川","田","浦","野","田","末","木","廣","田","久","崎","隈","山","垣","貫","山","永","沼","嶋","本","河","嶋","光","柳","井","子","持","岡","部","谷","智","矢","藤","谷","山","本","井","江","野","部","松","出","久","成","花","上","田","近","砂","橋","知","川","住","本","井","脇","根","上","内","上","山","松","畑","込","澤","江","川","矢","生","坂","佐","穂","谷","戸","田","生","栗","蔵","原","山","津","松","島","和","木","郷","松","川","林","羽","田","嵜","瀬","川","院","井",
                "豆","井","中","居","里","沢","寺","光","富","根","永","元","野","見","住","村","曲","角","谷","川","谷","沢","水","永","向","多","川","丸","沼","辻","村","告","川","岡","場","堀","間","川","巻","浦","長","尾","永","木","場","原","坂","子","矢","文字","任","倉","部","岩","部","崎","柴","川","南","原","留","井","方","林","厨","山","島","山","山","浦","永","川","野","成","桁","田","科","村","浜","市","貝","里","下","尾","田","田","丸","嶋","下","浦","間","端","木","前","嶌","木","柳","山","北","部","岡","木","竹","又","井","本","野","石","崎","井","出","重","村","山","見","部","井","村","加","河","井","元","城","屋","成","泉","添","光","田","倉","松","谷","坪","寺","橋","沢","松","垣","野","柳","子","田","田","園","羽","町","山","山","波","内","藤","村","治","澤","本","満","谷","鳥","内","羽","村","尾","出","賀","藤","部","妻","元","巣","村","原","籠","村","長","井","近","沢","森","野","崎","田","原","屋","角","田","田","島","名","野","原","本","町","石","島","丸","増","堤","出","匠","町","男","又","宮","山","濱","浜","瀧","岡","郷","吉","内","開","林","倉","平","岡","角","平","反田","上","丸","手","瀬","西","中","嶺","貝","苅","松","串","口","内","見","和","澤","澤","沢","部","神","島","実","本","田","鹿","伏","倉","吉","金","浦","井","原","沢","下","谷","江","浦","内","嶋","江","地","井","淵","上","田","山","波","方","田","坂","内","谷","柿","野","神","羽根","池","原","田","本","森","仲","戸","橋","田","崎","水","鍋","尾","戸","嶋","嶋","野","本","沢","森","平","渕","間","田","海","戸","津","井","塚","森","野","垣","江","座","前","武","麗","山","崎","中","端","城寺","林","家","原","名","向","沢","光","井","富","村","野","村","胡","羽","川","水","名","井","岡","舘","山","南","島","越","寄","保","浦","美","蒲","武","志","川","羽","川","沼","光","原","園","宗","丸","之下","荻","下","長","下","形","澤","町","谷","間","田","田","越","実","本","倉","楽","島","谷","間","松","切","地","田","山","塚","口","島","村","閑","副","輪","元","花","出","鷹","見","本","根","見","山","楠","寺","久","田","沢","泉","路","嶺","瀬","岡","岡","内","渕","塚","身","種","町","木","光","語","守","並","坂","場","泉","丸","陽","坂","島","田","立","原","江","田","塚","浪","里","山","方","内","室","原","宅","原","山","山","所","富","中","谷","津","銘","岡","枝","島","保","河","原","栗","野","手","木","佐","川","森","内","木","田","原","覧","谷","本","地","橋","城","河","木","里","元","堂","作","賀","間","西","童","村","川","生","谷","窪","津","高","村","出","内","井","立","岡","坂","谷","海",
                "谷","安","田","屋","岡","下","上","沢","田","盛","田","田","園","澤","谷","子","川","江","崎","澤","石","本","川","波","村","安","井","谷","本","谷","中","谷","掛","村","尾","嶋","橋","本","合","口","木","屋","嶋","沼","田","口","吉","本","下","泉","上","船","田","井","士","流","岡","口","東","潟","武","田","岡","部","室","部","岡","和","島","木","澤","笠","根","元","川","真","野","阪","守","津","島","山","本","岡","田","川","藤","木","波","津","坂","木","網","野倉","国","家","口","田","根","多","堂","光","石","田","﨑","次","井","山","藤","川","﨑","我","田","荘","齋","井","敷","間","中","寺","口","易","田","鍋","山","井","橋","代","見","井","薗","崎","村","中","庭","越","嶋","中","近","永","川","田","原","隅","田","沢","木","住","田","吉","中","西","草","知","名","岡","島","崎","丸","鎌","川","木","里","美","原","丸","木","口","村","木","馬","平","上","川","中","原","末","伏","橋","谷","木","澤","川","飽","古","倉","谷","尻","畑","平","峯","木","峯","部","井","倉","柄","沢","本","弘","間","松","垣","林","杉","水","見","内","辻","咲","脇","之瀬","川","谷","枝","柴","庭","前","見","谷","間","井","井","部","山","田","見","武","藤","波","谷","代","岡","生","本","島","林","戸","丸","前","谷","老","末","郷","部","留","安","川","坪","郷","川","風","原","江","沢","後","崎","島","松","原","巣","津","間","城","宮","知","谷","野","城","見","井","山","池","室","司","根","茂","津","主","野","山","原","谷","部","館","口","詰","戸","村","城","田","ノ上","笠","亀","路","貝","田","持","間","田","辺","久","里","東","曳","壁","津","本","田","重","辺","天","波","室","場","浦","田","部","田","水","関","藤","田","薗","木","武","原","谷","腰","越","本","貫","家","堀","士","熊","前","中","込","沼","淵","北","手","保","川","谷","澤","谷","間","毛","本","沢","山","松","田","越","原","坂","田","山","部","川","引","谷","良","井","元","島","冨","木","海","川","田","浦","野","田","末","木","廣","田","久","崎","隈","山","垣","貫","山","永","沼","嶋","本","河","嶋","光","柳","井","子","持","岡","部","谷","智","矢","藤","谷","山","本","井","江","野","部","松","出","久","成","花","上","田","近","砂","橋","知","川","住","本","井","脇","根","上","内","上","山","松","畑","込","澤","江","川","矢","生","坂","佐","穂","谷","戸","田","生","栗","蔵","原","山","津","松","島","和","木","郷","松","川","林","羽","田","嵜","瀬","川","院","井","垣","豆","井","中","居","里","沢","寺","光","富","根","永","元","野","見","住","村","曲","角","谷","川","谷","沢","水","永","向","多","川","丸","沼","辻","村",
                "川","岡","場","堀","間","川","巻","浦","長","尾","永","木","場","原","坂","子","矢","字","任","倉","部","岩","部","崎","柴","川","南","原","留","井","方","林","厨","山","島","山","山","浦","永","川","野","成","桁","田","科","村","浜","市","貝","里","下","尾","田","田","丸","嶋","下","浦","間","端","木","前","嶌","木","柳","山","北","部","岡","木","竹","又","井","本","野","石","崎","井","出","重","村","山","見","部","井","村","加","河","井","元","城","屋","成","泉","添","光","田","倉","松","谷","坪","寺","橋","沢","松","垣","野","柳","子","田","田","園","羽","町","山","山","波","ノ内","藤","村","治","澤","本","満","谷","鳥","内","羽","村","尾","出","賀","藤","部","妻","元","巣","村","原","籠","村","長","井","近","沢","森","野","崎","田","原","屋","角","田","田","島","名","野","原","本","町","石","島","丸","増","堤","出","匠","町","男","又","宮","山","濱","浜","瀧","岡","郷","吉","内","開","林","倉","平","岡","角","平","田","上","丸","手","瀬","西","中","嶺","貝","苅","松","串","口","内","見","和","澤","澤","沢","部","神","島","実","本","田","鹿","伏","倉","吉","金","浦","井","原","沢","下","谷","江","浦","内","嶋","江","地","井","淵","上","田","山","波","方","田","坂","内","谷","柿","野","神","羽根","池","原","田","本","森","仲","戸","橋","田","崎","水","鍋","尾","戸","嶋","嶋","野","本","沢","森","平","渕","間","田","海","戸","津","井","塚","森","野","垣","江","座","前","武","麗","山","崎","中","端","城寺","林","家","原","名","日向","沢","光","井","富","村","野","村","胡","羽","川","水","名","井","岡","舘","山","南","島"],
    "first_f_1":["愛","藍","葵","蒼","茜","秋","璃","梓","文","彩","綾","絢","紋","歩","杏","糸","稲","祈","祷","海","麗","楓","香","叶","鼎","中","菊","掬","粂","香","幸","琴","咲","桜","櫻","祥","幸","里","智","栞","雫","忍","偲","鈴","菫","空","妙","環","椿","蕾","紬","露","友","智","朋","凪","和","花","華","春","柊","瞳","雛","響","舞","祭","円","澪","緑","翠","南","陽","稔","穂","雅","明","恵","芽","椛","安","結","唯","悠","縁","紫","由","雪","米","蘭","藍","律","涼","鈴","凛","麟","和"],
    "first_f_2a":["亜","逢","亜","愛","亜","愛","哀","愛","愛","愛","愛","愛","逢","愛","藍","亜衣","愛","藍","哀","愛","愛","愛","愛","愛","愛","逢","碧","青","碧","朱","朱","明","朱","明日","紅","茜","安","亜","亜","愛","明","亜希","暁","晃","亜紀","彬","明","明","秋","明","聡","秋","穐","龝","明","明","昭","晶","亜玖","亜久","椏久","阿久","阿久","阿久","亜玖","阿","亜","杏","愛","安","海","浅","朝","麻","浅","麻","淺","朝","浅","阿佐","亜沙","明日","阿須","飛","明日","朱崇","飛","杏寿","梓","亜津","安","杏","愛","愛","敦","集","篤","貴","惇","亜","彩","綾","彩","彩","彩","絢","綾","彩","文","絢","菖","文","彩","彩","綾","絢","綾","麻","亜","愛","杏","海","愛","愛優","歩","歩","歩","歩","亜由","愛結","遥","有","有","有","有","亜理","亜里","亜梨","安里","杏","杏","杏","安","杏","唯","伊","衣","依","五十","伊","市","一","祈","伊","伊","彩","色","色","宇","羽","卯","初","羽","宇","羽","麗","小","麗","絵","瑛","恵","英美","絵美","瑛美","恵美","愛美","恵","英","瑛","恵梨","絵梨","瑛里","恵理","絵理","江里","恵里","衣梨","恵令","英玲","江玲","絵玲","音","音","乙","乙十","音","香","香","佳","花","夏","香","香","香","佳","花","加","佳那","花","風","鹿","奏","花","夏","花","華","神","環","樹","稀","輝","黄","木","京","恭","響","綺羅","喜楽","綺羅","喜楽","季楽","樹楽","切","霧","貴理","希理","希里","金","菫","琴","粂","久米","久美","公美","久実","玖美","九","心","心","木","琴","小","木","恋","此乃","香","心乃","小","心","恋","小","恋","来","桜","沙","紗","咲","紗栄","紗","紗絵","佐恵","沙","沙保","紗","佐","紗","咲","桜","櫻","桜","貞","定","禎","節","佐","紗","咲","彩","皐","皐","沙","咲","茶","彩","里","里","聡","佐","佐","紗","紗","沙","沙也","爽","紗弥","小百","沙友","紗友","紗","早","沙代","沙","彩","咲","佐","彩","咲","佐","詩","栞","史緒","志","紫","静","志","志","支","思","紫","志","志","紫","忍","篠","史帆","紫帆","志保","志穂","詩穂","珠","珠","樹","朱","朱","珠里","翔","聖","祥","晶","珠","寿","鈴","涼","凉","純","清","純","聖","晴","星","静","芹","芹","瀬里","世里","宇","青","蒼","多","多","大","貴","孝","隆","玉","珠","玉","珠","玉","珠","珠","玉","瓊","智","智","千","千","千","知","千","知","親","千香","千賀","千佳","千","知","千","千","知","千","千","千","千","千","千","智","澄","月","亜","津久","継","椿","蕾","紬","月","時","朱鷺","時","登","友","灯","智","朋","知","永","永","兎","兎","翔","直","長","那","奈","菜","和","夏","夏","菜","奈","夏","夏","夏","夏","菜","七","奈","菜","那","奈","奈","七","七","菜々","七","奈々","七","奈々","凪","那奈","菜ノ","菜乃","七","菜乃","奈","那","浪","奈美","奈美","奈美","波","日","寧","音","猫","音","乃","希","希","長","野","野","乃","乃々","野乃","野々","信","伸","敦","羽","葉","初","初","初","波","羽","花","華","花","華",
                "葉","春","晴","榛","榛","春","陽","晴","春","遥","春","春","春","春","晴","仁","比","雲","陽羽","妃羽","日","向日","風","風","扶","藤","不二","富士","双","二","双","文","史","文","富美","史","螢","穂","保奈","帆","穂","穂乃","麻","真","舞","舞","舞","舞","麻衣","真","麻","真","雅","正","政","昌","正","雅","真","真","真知","真千","町","松","松","松","末","茉","円","真","真","舞","茉","蒔","愛","愛","真奈","愛","愛","真","眞","真","真","舞","摩","真","真","茉","麻由","真由","真悠","真優","真由","真有","麻莉","真莉","麻璃","聖","麻莉","真梨","麻璃","茉莉","美","美","美","美","三","三","美","美","美","美","美","美","未","美","未","美","美","美","三","未来","魅","実","海","美","美","美","美沙","美佐","実彩","美","実","水","瑞","美","美","美","美","美","美","美智","美知","美","充","満","海","深","海月","光","美津","美都","苗","美","美","美奈","美那","美","水","美野","三","美","実","美","弥","宮","美弥","美","海","心","美","美由","美","三","未","未","未","美","美","美","美","愛","芽","萌","萌","芽","明","芽衣","明","芽依","芽","芽","芽","愛","愛","愛","萌","萌","桃","桃","最","紅","萌美","百","百","百","桃","桃","百々","八","弥","八千","弥千","夜千","靖","泰","安","弥","夜","弥","由","結","結","祐","優","有","有","友","由","由","由","由香","由加","由","雪","由紀","優","結","優","柚","優","由","由","夢","夢","百","友","優","友莉","優里","悠里","陽","洋","葉","瑤","与","夜","良","蘭","羅","理","梨","利","里","梨","里","凛","梨","莉","理","梨","凛","璃","理","梨","理","凛","凛","里","里","梨","梨","莉","璃","里","里","莉","凛","莉","莉","里","梨","理","璃","梨","梨里","梨々","璃々","梨々","梨々","凛々","瑠","琉","瑠","麗","玲","麗","玲","怜","麗","怜","零","澪","莉","玲於","玲緒","玲央","玲","麗","麗","玲","玲","若","和佳","若"],
    "first_f_2b":["衣","生","依","衣","惟","衣","歌","華","河","佳","香","花","香","子","子","子","羅","良","羅","蘭","理","梨","莉","里","璃","生","衣","衣","海","音","音","音","子","音","音","音","城","紀","希","生","子","子","子","子","子","子","菜","奈","奈","那","菜","葉","葉","葉","世","代","代","代","璃","里","里","利","里","鯉","璃","古","子","心","心","子","心","野","乃","乃","見","美","見","美","海","美","美","香","賀","花","架","花","華","沙","紗","沙","住","美","純","澄","子","子","子","子","子","弥","花","香","香","夏","佳","香","子","子","子","子","蒲","目","芽","女","女","愛","姫","有","由","結","優","優","優","香","香","夏","美","望","美","実","花","佐","紗","沙","咲","砂","沙","沙","紗","奈","菜","里","里","璃","桜","桜","織","央","鈴","鈴","子","葉","里","予","代","葉","葉","波","井","唯","衣","衣","衣","美","海","羅","春","蘭","麻","麻","麻","里","里","里","里","莉","利","莉","梨","香","花","華","子","子","子","菜","奈","奈","奈","奈","奈","羽","波","葉","葉","葉","織","里","織","織","織","住","澄","菜","奈","奈","奈","恵","音","暖","音","音","梨","鈴","蓮","蓮","奈","奈","々","妃","々","緑","緑","子","子","子","羅","々","拉","里","里","里","子","子","子","子","子","子","子","子","子","子","子","子","子","子","女","愛","珠","霊","子","夏","夏","夏","美","海","美","春","陽","春","雪","雪","幸","綺","綾","綾","文","子","子","子","子","織","里","織","倉","倉","良","子","子","心","子","子","子","子","知","千","智","智","月","月","月","月","兎","都","見","美","美","奈","菜","綾","椰","弥","加","風","加","合","理","里","由","由","里","羅","良","楽","波","羽","葉","和","織","里","里","織","織","空","那","奈","那","奈","野","野","乃","乃","舞","生","里","里","里","里","里","里","李","里","里","莉","亜","子","子","子","子","洲","鶴","音","音","音","麗","麗","恋","子","子","羅","羅","那","奈","奈","奈","宙","空","空","恵","枝","恵","子","子","子","緒","緒","尾","桜","木","希","姫","子","子","慧","恵","佳","歌","花","花","景","景","子","子","子","子","紗","里","世","鶴","弦","歳","早","春","晴","代","夜","代","江","子","実","美","未","妃","実","希","結","枝","江","栄","米","香","華","花","佳","花","久","遠","羽","葉","和","江","子","岐","子","心","心","木","樹","月","月","紀","希","海","美","々","菜","々","奈","奈","緒","央","桜","緒","子","瀬","瀬","海","未","波","美","葉","葉","葉","羽","美","美","江","恵","江","絵","子","香","々","々","音","子","愛","空","望","閑","乃","々","之","花","香","花","子","子","子","月","月","仔","子","音","奈","奈","子","子","代","代",
                "瑠","子","心","子","名","名","菜","菜","菜","奈","日","姫","燈","妃","姫","美","奈","雀","里","理","晴","葵","花","子","紀","子","子","子","葉","葉","羽","枝","絵","香","加","香","子","波","美","波","香","果","衣","衣","依","香","花","子","子","央","央","緒","子","子","子","子","代","代","茅","智","子","子","子","江","枝","恵","里","莉","加","名","魚","菜","奈","菜","美","未","美","海","実","帆","穂","美","実","美","耶","弥","由","優","子","子","子","子","美","美","亜","愛","亜","愛","愛","耶","也","也 ","宇","海","羽","優","江","枝","桜","緒","香","佳","樹","紀","來","希","来","久","玖","来","空","月","來","來","来","佐","沙","彩","子","子","子","里","里","樹","希","月","鈴","玲","怜","澪","智","子","子","月","希","月","月","月","姫","子","子","子","子","奈","菜","子","子","波","美","里","春","春","春","々","々","子","子","優","夕","結","幸","紀","代","代","来","蕾","來","和","輪","羽","波","生","生","生","衣","唯","衣","子","子","子","来","玖","紅","流","琉","留","亜","愛","杏","愛","愛","葉","路","日","花","華","香","子","子","重","栄","代","代","代","子","子","子","生","宵","衣","比","衣","城","希","希","紀","希","希","加","佳","香","里","里","紀","乃","乃","菜","菜","奈","凪","風","布","芙","野","乃","合","梨","里","亜","亜","愛","子","子","子","子","根","音","々","々","々","恵","衣","恵","恵","花","香","華","香","子","子","子","恋","子","沙","沙","紗","桜","月","奈","菜","奈","乃","乃","乃","帆","穂","歩","穂","茉","麻","々","里","梨","々","璃","杏","愛","愛","花","華","華","璃","璃","梨","華","香","香","奈","奈","奈","羅","羅","羅","蘭","奈","菜","那","奈","乃","美","美","海","菜","奈","葉"],
    "first_m_1":["葵","碧","暁","曉","旺","明","晶","章","彰","晃","昭","彬","旭","昌","輝","梓","東","中","敦","歩","磐","海","開","霞","基","潔","清","元","源","弦","玄","現","厳","剣","栄","榮","朔","咲","聡","智","愉","悟","瞬","駿","俊","舜","峻","隼","竣","春","儁","嬢","譲","穣","烝","白","陣","仁","勝","優","傑","卓","秀","豪","平","卓","匠","巧","武","猛","尊","健","佐","正","環","智","力","翼","剛","強","通","爆","縛","一","弌","甫","初","始","孟","肇","元","創","萌","朔","颯","彦","光","英","秀","博","宏","浩","洋","寛","真","雅","柾","学","守","護","衛","鎮","調","満","溢","統","源","稔","悠","優","雄","勇","悠","裕","佑","侑","友","豊","陸","律","綾","類","塁","累","漣","錬","廉","恋","蓮","亘","渉","渡","弥","航"],
    "first_m_2a":["悪","篤","篤","淳","敦","亜","亜","亜","歩","歩","新","新","安","石","以","一","一","一","一","一","一","一","雅","宇","永","永","英","大","海","岳","岳","景","一","和","数","和","一","一","和","佳","一","数","一","和","一","数","数","和","一","一","一","一","和","麗","勝","勝","神","神","可","京","京","国","国","国","邦","国","国","久","啓","圭","慶","敬","恵","元","健","賢","健","玄","健","謙","賢","剣","剣","健","謙","賢","建","賢","検","健","賢","健","賢","光","浩","宏","幸","晃","康","公","紘","洸","広","宏","公","康","耕","航","洸","幸","小","小","小","琥","虎","剣","権","佐","咲","咲","紗","咲","咲","佐","茶","左","讃","小","佐","貞","定","定","定","貞","貞","貞","悟","敏","聡","悟","三","三","三","重","繁","鎮","繁","重","重","重","重","成","信","史","俊","駿","俊","駿","駿","峻","隼","俊","竣","淳","純","順","潤","絢","准","隼","総","荘","莊","宗","颯","松","翔","将","将","章","昇","祥","星","翔","匠","正","承","昌","翔","祥","庄","正","勝","尚","鍾","治","二","次","慎","信","信","真","晋","信","慎","真","信","慎","真","新","真","清","真","信","新","親","優","助","千","大","大","大","大","大","大","大","大","大","太","大","大","大","大","大","大","大","大","大","太","大","大","大","大","大","太","大","大","黛","太","高","貴","鷹","高","琢","拓","拓","匠","拓","拓","拓","琢","拓","卓","武","武","武","竹","剛","健","民","多","太","長","千","飛","椿","空","剛","剛","豪","剛","鉄","鉄","哲","哲","徹","鉄","伝","天","藤","童","東","東","時","時","時","時","登","敏","富","智","友","智","朝","知","智","智","寅","虎","直","直","尚","直","尚","尚","直","直","直","永","長","永","長","寿","長","那","信","伸","徳","一","疾","早","颯","早","隼","春","飛","彦","久","秀","英","秀","秀","秀","一","平左","宏","弘","広","博","博","博","浩","博","洋","浩","大","大","博","博","博","風","福","藤","文","冨","文","郁","風","郁","文","文","史","文","史","史","平","平","兵","平","方","北","穂","穂","正","雅","将","正","将","雅","聖","正","証","真","正","雅","政","昌","正","正","正","正","正","正","正","又","幹","水","水","水","瑞","美","瑞","彌","美","道","光","光","光","光","宗","宗","宗","統","保","弥","大","雄","勇","優","雄","勇","悠","裕","佑","侑","友","優","雄","勇","悠","裕","佑","侑","友","優","雄","勇","悠","裕","佑","侑","友","優","雄","勇","悠","裕","佑","侑","友","雄","雄","勇","裕","悠","雪","行","雪","幸","幸","幸","幸","幸","義","美","吉","由","義","吉","頼","頼","雷","莉","凛","莉","竜","竜","涼","瑠","琉","瑠","瑠","留","玲","怜","玲","獅","玲","玲","玲","玲"],
    "first_m_2b":["太","志","史","史","史","土夢","飛夢","門","実","美","太","汰","治","松","蔵","志","太郎","松","郎","輝 ","光","世","楽","宙","遠","吉","二","昇","人","登","人","清","仁","人","人","仁","人","馬","真","主馬","真","馬","矢","也","八","屋","矢","義","翔","登","斗","刀","人","斗","虎","英","居","威","夢偉","介","太郎","包","重","久","人","光","安","保","太","太","太","太","太","気","児","治","二","樹","三","三","三","蔵","三","太","太","汰","太","太","太郎","太郎","太郎","人","人","一","一","一","一","一","一","一","一","一","大","大","平","平","平","平","平","平","次郎","二郎","次朗","次郎","次朗","八","八","久","玖","玖","空","來","空","助","介","介","助","助","介","治","春","治","晴","春","晴","芳","志","史","志","史","吉","四郎","平","信","延","信","信","信","久","政","光","宗","夫","門","介","佑","輔","介","輔","輔","輔","亮","介","平","平","平","平","平","平","平","司","司","子","治","二","寿丸","太","太","汰","大","太","太","汰","大","大","太","太","平","平","平","平","平","利","里","離","郎","郎","郎","吾","五","吾","虎","呉","悟","悟","司","士","二","治","田","汰","太","汰","太","兵衛","兵衛","流","六","鶴丸","河","我","賀","輝","貴","樹","吉","吾","悟","吾","五郎","伍郎","三郎","治","輔","介","助","補","祐","輔","亮","佑","成","蔵","地","平","也","弥","也","陽","雄","志","司","徳","磨","馬","海","海","実","哉","也","也","矢","哉","市","雄","士","千代","流","流","雄","聞","郎","栄","代丸","翔","咲","翔","志","史","士","之","山","平","也","哉","也","矢","助","馬","次郎","夢","洋","里","生","尾","雄","男","喜男","太郎","吉","一","樹","樹","城","樹","輝","紀","次郎","次郎","樹","木","樹","紀","輝","希","司","人","登","久","政","将","昌","昌","安","智","長","幸","重","歩","風","手","天","人","人","吉","虎","市","常","明","明","章","秋","晃","二三","衛門","明","明","明","昭","昭","士","史","文","文","文","海","夢","善","喜","義","太","太郎","丸","雄","美家","哉","弥","見也","哉","一","和","和","明","明","暁","蔵","造","蔵","藏","正","斗","高","積","木","紀","暉","樹","生","樹","人","人","人","人","則","規","則","徳","治","弘","行","吉","義","留","流","吉","久","木","樹","城","希","月","木","月","津紀","生","明","邦","徳","洋","近","親","睦","義","志","太郎","和","一郎","気","一郎","一郎","一郎","一郎","一郎","一郎","一郎","一郎","治郎","治郎","治郎","治郎","治郎","治郎","治郎","治郎","次郎","次郎","次郎","次郎","次郎","次郎","次郎","次郎","二郎","二郎","二郎","二郎","二郎","二郎","二郎","二郎","大","斗","斗","翔","人","之丞","徳","大","宏","弘","大","博","也","家","和","成","伸","範","弘","家","元","太","来","空","玖","二","門","平","偉","衣","唯","偉","伊","央","央","生","子","於奈","緒菜","央那","於那"]
}

/*
    let occupation_num_dic = [];
    for(let i = 0; i < occupation_data.length; i++)
    {
        for(let j = 0; j < occupation_data[i].occupation.length; j++)
        {
            occupation_num_dic.push({});
            occupation_num_dic[occupation_num_dic.length-1].occupation = occupation_data[i].occupation[j];
            occupation_num_dic[occupation_num_dic.length-1].num = [i, j]
        }
    }
*/ 

const occupation_data =
[
    {
        occupation:["医師", "アニマルセラピスト", "看護師", "救急救命士", "形成外科医", "精神科医", "闇医者", "内科医", "外科医", "薬剤師", "介護士", "臨床技師", "医学生", "看護学生", "メンタルセラピスト", "企業カウンセラー", "スクールカウンセラー", "院内セラピスト"],
        skills:["医学", "応急手当", "経理", "信用", "生物学", "説得", "薬学", "ほかの言語", "聞き耳", "心理学", "精神分析", "生物学", "化学", "言いくるめ", "目星", "法律"]
    },
    {
        occupation:["エンジニア", "設計技術者", "機関士", "整備士", "設計建築士", "工業高校生", "工業専門学生"],
        skills:["機械修理", "コンピューター", "重機械操作", "電気修理", "図書館", "物理学", "ほかの言語", "化学", "地質学", "電子工学"]
    },
    {
        occupation:["教信者", "カルト信者", "極左活動家", "極右活動家"],
        skills:["隠す", "隠れる", "心理学", "説得", "図書館", "ほかの言語", "化学", "電気修理", "法律", "薬学", "ライフル", "ショットガン", "スタンガン"]
    },
    {
        occupation:["警察官", "専任捜査官", "交番勤務", "地域課", "交通課職員", "機動隊員", "交通機動隊員", "警察官僚", "警察学校生徒"],
        skills:["言いくるめ", "聞き耳", "心理学", "追跡", "法律", "目星", "運転", "信用", "組みつき", "武道", "日本刀", "拳銃", "杖", "機械修理", "信用", "操縦", "登攀", "ナビゲート", "法律", "サバイバル", "投擲", "応急手当"]
    },
    {
        occupation:["芸術家", "画家", "彫刻家", "書家", "漫画家", "カメラマン", "デザイナー", "映画監督", "美大生", "芸大生", "ダンサー", "デザイナー"],
        skills:["言いくるめ", "芸術", "コンピューター", "写真術", "心理学", "製作", "目星", "歴史", "博物学", "図書館", "説得", "変装"]
    },
    {
        occupation:["古物研究科", "古書店主", "骨董品店主", "博物館学芸員", "図書館司書", "郷土史家", "美大生", "考古学部生"],
        skills:["芸術", "コンピューター", "製作", "図書館", "値切り", "ほかの言語", "目星", "歴史", "説得"]
    },
    {
        occupation:["コンピューター技術者", "プログラマー", "システムエンジニア", "ネットワーク管理者", "ゲームクリエーター", "ハッカー", "工業高校生", "工業専門学生"],
        skills:["言いくるめ", "経理", "コンピューター", "電気修理", "電子工学", "図書館", "物理学", "ほかの言語", "製作"]
    },
    {
        occupation:["作家", "小説家", "翻訳家", "脚本家", "漫画家", "文学部生"],
        skills:["オカルト", "芸術", "心理学", "説得", "図書館", "ほかの言語", "母国語", "歴史"]
    },
    {
        occupation:["自衛官", "防衛大生", "自衛官", "陸上自衛隊員", "海上自衛隊員", "自衛隊パイロット", "民間軍会社メンバー"],
        skills:["運転", "応急手当", "機械修理", "重機械操作", "操縦", "ナビゲート", "回避", "隠れる", "聞き耳", "経理", "忍び歩き", "信用", "説得", "値切り", "法律", "ほかの言語", "こぶし", "キック", "組みつき", "武道", "サブマシンガン", "ライフル", "グレネード・ランチャー", "砲", "拳銃", "サバイバル", "水泳", "登攀", "投擲"]
    },
    {
        occupation:["ジャーナリスト", "新聞記者", "通信社員", "雑誌記者", "雑誌編集者", "テレビリポーター", "通信アナウンサー", "ニュースブロガー", "経済学部生"],
        skills:["言いくるめ", "写真術", "心理学", "説得", "図書館", "母国語", "ほかの言語", "歴史", "信用"]
    },
    {
        occupation:["宗教家", "僧侶", "尼僧", "神職", "巫女", "神父", "牧師", "修道女", "山伏", "易者", "宗教学部生", "哲学部生"],
        skills:["オカルト", "聞き耳", "経理", "心理学", "説得", "図書館", "歴史", "言いくるめ", "信用", "ほかの言語"]
    },
    {
        occupation:["商店主", "店員", "コンビニ店員", "飲食店員", "販売店店員", "店主", "ネットショップ経営者", "経営学部生"],
        skills:["言いくるめ", "聞き耳", "経理", "心理学", "信用", "値切り", "運転", "コンピューター"]
    },
    {
        occupation:["私立探偵", "探偵社員", "興信所職員", "保険調査員", "法律家", "弁護士", "公認会計士", "税理士", "司法書士", "行政書士", "弁護士", "公証人", "法学家", "法科学生"],
        skills:["言いくるめ", "鍵開け", "心理学", "追跡", "図書館", "法律", "聞き耳", "写真術", "値切り", "スタンガン"]
    },
    {
        occupation:["水産業従事者", "漁師", "養殖業者", "水産加工業者", "ダイバー", "海女", "海人", "水産大学生"],
        skills:["機械修理", "重機械操作", "水泳", "操縦", "天文学", "ナビゲート", "博物学", "目星"]
    },
    {
        occupation:["野球選手", "Jリーグ選手", "ゴルファー", "ボクサー", "プロレスラー", "関取", "登山家", "射撃選手", "体育大学生", "体育教師"],
        skills:["回避", "芸術", "登攀", "投擲", "跳躍", "応急手当", "こぶし", "キック", "組みつき", "武道"]
    },
    {
        occupation:["大学教授", "冒険家教授", "評論家", "研究機関従事者"],
        skills:["信用", "心理学", "説得", "図書館", "値切り", "ほかの言語", "医学", "化学", "考古学", "人類学", "生物学", "地質学", "電子工学", "天文学", "博物学", "物理学", "法律", "歴史", "母国語", "応急手当", "オカルト"]
    },
    {
        occupation:["タレント", "アイドル", "俳優", "声優", "イベント司会者", "マジシャン", "ダンサー", "レースクイーン", "音楽タレント", "アナウンサー", "コメディアン", "スポーツタレント", "コメンテーター", "プロデューサー", "マネージャー", "ミュージシャン", "ロックバンド", "ストリートミュージシャン", "シンガーソングライター", "作詞家", "作曲家"],
        skills:["言いくるめ", "聞き耳", "信用", "心理学", "説得", "芸術", "変装", "ほかの言語", "図書館", "値切り", "目星", "隠れる", "忍び歩き"]
    },
    {
        occupation:["超心理学者", "ゴーストハンター", "占い師", "スピリチュアリスト", "霊媒師"],
        skills:["オカルト", "人類学", "写真術", "心理学", "精神分析", "図書館", "ほかの言語", "歴史", "物理学", "芸術", "値切り", "説得"]
    },
    {
        occupation:["ディレッタント", "資産家", "投資家", "大企業の会長", "ビルオーナー"],
        skills:["運転", "芸術", "信用" ,"図書館" ,"法律", "ほかの言語", "乗馬", "写真術", "操縦", "拳銃", "ライフル", "ショットガン", "武道"]
    },
    {
        occupation:["ドライバー", "タクシー運転士", "バス運転士", "トラック運転士", "大富豪のお抱え運転手", "バイク便", "レーサー", "パイロット", "旅客機操縦士", "輸送機操縦士", "自家用操縦士", "航空自衛官", "放浪者", "バックパッカー", "自動車旅行者", "旅打ちギャンブラー", "屋台の的屋", "出稼ぎ労働者", "お遍路さん"],
        skills:["運転", "機械修理", "聞き耳", "重機械操作", "電気修理", "ナビゲート", "値切り", "目星", "信用", "電気修理", "天文学", "操縦"]
    },
    {
        occupation:["農林業従事者", "農家", "酪農家", "畜産業者", "養蜂業者", "林業者", "ハンター", "農大学生"],
        skills:["応急手当", "機械修理", "重機械操作", "製作", "追跡", "電気修理", "博物学", "杖", "ライフル", "ショットガン", "チェーンソー"]
    },
    {
        occupation:["ビジネスマン", "営業マン", "事務員", "金融業者", "企業コンサルタント", "通訳", "秘書", "公務員", "経営学生", "商業科学生", "執事", "メイド", "セールスマン"],
        skills:["言いくるめ", "経理", "コンピューター", "信用", "説得", "値切り", "法律", "ほかの言語", "応急手当", "聞き耳", "芸術", "目星", "運転"]
    },
    {
        occupation:["暴力団組員", "ヤクザ", "極道者", "マフィア"],
        skills:["言いくるめ", "隠す", "心理学", "値切り", "目星", "隠れる", "こぶし", "キック", "組みつき", "武道", "日本刀", "ナイフ", "拳銃"]
    },
    {
        occupation:[],
        skills:["言いくるめ", "コンピューター", "信用", "説得", "値切り", "法律", "ほかの言語", "応急手当", "聞き耳", "目星", "運転","図書館"]
    }
]

const occupation_num_dictionary =
[
    {"occupation":"医師","num":[0,0]},
    {"occupation":"アニマルセラピスト","num":[0,1]},
    {"occupation":"看護師","num":[0,2]},
    {"occupation":"救急救命士","num":[0,3]},
    {"occupation":"形成外科医","num":[0,4]},
    {"occupation":"精神科医","num":[0,5]},
    {"occupation":"闇医者","num":[0,6]},
    {"occupation":"内科医","num":[0,7]},
    {"occupation":"外科医","num":[0,8]},
    {"occupation":"薬剤師","num":[0,9]},
    {"occupation":"介護士","num":[0,10]},
    {"occupation":"臨床技師","num":[0,11]},
    {"occupation":"医学生","num":[0,12]},
    {"occupation":"看護学生","num":[0,13]},
    {"occupation":"メンタルセラピスト","num":[0,14]},
    {"occupation":"企業カウンセラー","num":[0,15]},
    {"occupation":"スクールカウンセラー","num":[0,16]},
    {"occupation":"院内セラピスト","num":[0,17]},
    {"occupation":"エンジニア","num":[1,0]},
    {"occupation":"設計技術者","num":[1,1]},
    {"occupation":"機関士","num":[1,2]},
    {"occupation":"整備士","num":[1,3]},
    {"occupation":"設計建築士","num":[1,4]},
    {"occupation":"工業高校生","num":[1,5]},
    {"occupation":"工業専門学生","num":[1,6]},
    {"occupation":"教信者","num":[2,0]},
    {"occupation":"カルト信者","num":[2,1]},
    {"occupation":"極左活動家","num":[2,2]},
    {"occupation":"極右活動家","num":[2,3]},
    {"occupation":"警察官","num":[3,0]},
    {"occupation":"専任捜査官","num":[3,1]},
    {"occupation":"交番勤務","num":[3,2]},
    {"occupation":"地域課","num":[3,3]},
    {"occupation":"交通課職員","num":[3,4]},
    {"occupation":"機動隊員","num":[3,5]},
    {"occupation":"交通機動隊員","num":[3,6]},
    {"occupation":"警察官僚","num":[3,7]},
    {"occupation":"警察学校生徒","num":[3,8]},
    {"occupation":"芸術家","num":[4,0]},
    {"occupation":"画家","num":[4,1]},
    {"occupation":"彫刻家","num":[4,2]},
    {"occupation":"書家","num":[4,3]},
    {"occupation":"漫画家","num":[4,4]},
    {"occupation":"カメラマン","num":[4,5]},
    {"occupation":"デザイナー","num":[4,6]},
    {"occupation":"映画監督","num":[4,7]},
    {"occupation":"美大生","num":[4,8]},
    {"occupation":"芸大生","num":[4,9]},
    {"occupation":"ダンサー","num":[4,10]},
    {"occupation":"デザイナー","num":[4,11]},
    {"occupation":"古物研究科","num":[5,0]},
    {"occupation":"古書店主","num":[5,1]},
    {"occupation":"骨董品店主","num":[5,2]},
    {"occupation":"博物館学芸員","num":[5,3]},
    {"occupation":"図書館司書","num":[5,4]},
    {"occupation":"郷土史家","num":[5,5]},
    {"occupation":"美大生","num":[5,6]},
    {"occupation":"考古学部生","num":[5,7]},
    {"occupation":"コンピューター技術者","num":[6,0]},
    {"occupation":"プログラマー","num":[6,1]},
    {"occupation":"システムエンジニア","num":[6,2]},
    {"occupation":"ネットワーク管理者","num":[6,3]},
    {"occupation":"ゲームクリエーター","num":[6,4]},
    {"occupation":"ハッカー","num":[6,5]},
    {"occupation":"工業高校生","num":[6,6]},
    {"occupation":"工業専門学生","num":[6,7]},
    {"occupation":"作家","num":[7,0]},
    {"occupation":"小説家","num":[7,1]},
    {"occupation":"翻訳家","num":[7,2]},
    {"occupation":"脚本家","num":[7,3]},
    {"occupation":"漫画家","num":[7,4]},
    {"occupation":"文学部生","num":[7,5]},
    {"occupation":"自衛官","num":[8,0]},
    {"occupation":"防衛大生","num":[8,1]},
    {"occupation":"自衛官","num":[8,2]},
    {"occupation":"陸上自衛隊員","num":[8,3]},
    {"occupation":"海上自衛隊員","num":[8,4]},
    {"occupation":"自衛隊パイロット","num":[8,5]},
    {"occupation":"民間軍会社メンバー","num":[8,6]},
    {"occupation":"ジャーナリスト","num":[9,0]},
    {"occupation":"新聞記者","num":[9,1]},
    {"occupation":"通信社員","num":[9,2]},
    {"occupation":"雑誌記者","num":[9,3]},
    {"occupation":"雑誌編集者","num":[9,4]},
    {"occupation":"テレビリポーター","num":[9,5]},
    {"occupation":"通信アナウンサー","num":[9,6]},
    {"occupation":"ニュースブロガー","num":[9,7]},
    {"occupation":"経済学部生","num":[9,8]},
    {"occupation":"宗教家","num":[10,0]},
    {"occupation":"僧侶","num":[10,1]},
    {"occupation":"尼僧","num":[10,2]},
    {"occupation":"神職","num":[10,3]},
    {"occupation":"巫女","num":[10,4]},
    {"occupation":"神父","num":[10,5]},
    {"occupation":"牧師","num":[10,6]},
    {"occupation":"修道女","num":[10,7]},
    {"occupation":"山伏","num":[10,8]},
    {"occupation":"易者","num":[10,9]},
    {"occupation":"宗教学部生","num":[10,10]},
    {"occupation":"哲学部生","num":[10,11]},
    {"occupation":"商店主","num":[11,0]},
    {"occupation":"店員","num":[11,1]},
    {"occupation":"コンビニ店員","num":[11,2]},
    {"occupation":"飲食店員","num":[11,3]},
    {"occupation":"販売店店員","num":[11,4]},
    {"occupation":"店主","num":[11,5]},
    {"occupation":"ネットショップ経営者","num":[11,6]},
    {"occupation":"経営学部生","num":[11,7]},
    {"occupation":"私立探偵","num":[12,0]},
    {"occupation":"探偵社員","num":[12,1]},
    {"occupation":"興信所職員","num":[12,2]},
    {"occupation":"保険調査員","num":[12,3]},
    {"occupation":"法律家","num":[12,4]},
    {"occupation":"弁護士","num":[12,5]},
    {"occupation":"公認会計士","num":[12,6]},
    {"occupation":"税理士","num":[12,7]},
    {"occupation":"司法書士","num":[12,8]},
    {"occupation":"行政書士","num":[12,9]},
    {"occupation":"弁護士","num":[12,10]},
    {"occupation":"公証人","num":[12,11]},
    {"occupation":"法学家","num":[12,12]},
    {"occupation":"法科学生","num":[12,13]},
    {"occupation":"水産業従事者","num":[13,0]},
    {"occupation":"漁師","num":[13,1]},
    {"occupation":"養殖業者","num":[13,2]},
    {"occupation":"水産加工業者","num":[13,3]},
    {"occupation":"ダイバー","num":[13,4]},
    {"occupation":"海女","num":[13,5]},
    {"occupation":"海人","num":[13,6]},
    {"occupation":"水産大学生","num":[13,7]},
    {"occupation":"野球選手","num":[14,0]},
    {"occupation":"Jリーグ選手","num":[14,1]},
    {"occupation":"ゴルファー","num":[14,2]},
    {"occupation":"ボクサー","num":[14,3]},
    {"occupation":"プロレスラー","num":[14,4]},
    {"occupation":"関取","num":[14,5]},
    {"occupation":"登山家","num":[14,6]},
    {"occupation":"射撃選手","num":[14,7]},
    {"occupation":"体育大学生","num":[14,8]},
    {"occupation":"体育教師","num":[14,9]},
    {"occupation":"大学教授","num":[15,0]},
    {"occupation":"冒険家教授","num":[15,1]},
    {"occupation":"評論家","num":[15,2]},
    {"occupation":"研究機関従事者","num":[15,3]},
    {"occupation":"タレント","num":[16,0]},
    {"occupation":"アイドル","num":[16,1]},
    {"occupation":"俳優","num":[16,2]},
    {"occupation":"声優","num":[16,3]},
    {"occupation":"イベント司会者","num":[16,4]},
    {"occupation":"マジシャン","num":[16,5]},
    {"occupation":"ダンサー","num":[16,6]},
    {"occupation":"レースクイーン","num":[16,7]},
    {"occupation":"音楽タレント","num":[16,8]},
    {"occupation":"アナウンサー","num":[16,9]},
    {"occupation":"コメディアン","num":[16,10]},
    {"occupation":"スポーツタレント","num":[16,11]},
    {"occupation":"コメンテーター","num":[16,12]},
    {"occupation":"プロデューサー","num":[16,13]},
    {"occupation":"マネージャー","num":[16,14]},
    {"occupation":"ミュージシャン","num":[16,15]},
    {"occupation":"ロックバンド","num":[16,16]},
    {"occupation":"ストリートミュージシャン","num":[16,17]},
    {"occupation":"シンガーソングライター","num":[16,18]},
    {"occupation":"作詞家","num":[16,19]},
    {"occupation":"作曲家","num":[16,20]},
    {"occupation":"超心理学者","num":[17,0]},
    {"occupation":"ゴーストハンター","num":[17,1]},
    {"occupation":"占い師","num":[17,2]},
    {"occupation":"スピリチュアリスト","num":[17,3]},
    {"occupation":"霊媒師","num":[17,4]},
    {"occupation":"ディレッタント","num":[18,0]},
    {"occupation":"資産家","num":[18,1]},
    {"occupation":"投資家","num":[18,2]},
    {"occupation":"大企業の会長","num":[18,3]},
    {"occupation":"ビルオーナー","num":[18,4]},
    {"occupation":"ドライバー","num":[19,0]},
    {"occupation":"タクシー運転士","num":[19,1]},
    {"occupation":"バス運転士","num":[19,2]},
    {"occupation":"トラック運転士","num":[19,3]},
    {"occupation":"大富豪のお抱え運転手","num":[19,4]},
    {"occupation":"バイク便","num":[19,5]},
    {"occupation":"レーサー","num":[19,6]},
    {"occupation":"パイロット","num":[19,7]},
    {"occupation":"旅客機操縦士","num":[19,8]},
    {"occupation":"輸送機操縦士","num":[19,9]},
    {"occupation":"自家用操縦士","num":[19,10]},
    {"occupation":"航空自衛官","num":[19,11]},
    {"occupation":"放浪者","num":[19,12]},
    {"occupation":"バックパッカー","num":[19,13]},
    {"occupation":"自動車旅行者","num":[19,14]},
    {"occupation":"旅打ちギャンブラー","num":[19,15]},
    {"occupation":"屋台の的屋","num":[19,16]},
    {"occupation":"出稼ぎ労働者","num":[19,17]},
    {"occupation":"お遍路さん","num":[19,18]},
    {"occupation":"農林業従事者","num":[20,0]},
    {"occupation":"農家","num":[20,1]},
    {"occupation":"酪農家","num":[20,2]},
    {"occupation":"畜産業者","num":[20,3]},
    {"occupation":"養蜂業者","num":[20,4]},
    {"occupation":"林業者","num":[20,5]},
    {"occupation":"ハンター","num":[20,6]},
    {"occupation":"農大学生","num":[20,7]},
    {"occupation":"ビジネスマン","num":[21,0]},
    {"occupation":"営業マン","num":[21,1]},
    {"occupation":"事務員","num":[21,2]},
    {"occupation":"金融業者","num":[21,3]},
    {"occupation":"企業コンサルタント","num":[21,4]},
    {"occupation":"通訳","num":[21,5]},
    {"occupation":"秘書","num":[21,6]},
    {"occupation":"公務員","num":[21,7]},
    {"occupation":"経営学生","num":[21,8]},
    {"occupation":"商業科学生","num":[21,9]},
    {"occupation":"執事","num":[21,10]},
    {"occupation":"メイド","num":[21,11]},
    {"occupation":"セールスマン","num":[21,12]},
    {"occupation":"暴力団組員","num":[22,0]},
    {"occupation":"ヤクザ","num":[22,1]},
    {"occupation":"極道者","num":[22,2]},
    {"occupation":"マフィア","num":[22,3]}
];

const birth_place = ["北海道","青森県","岩手県","宮城県","秋田県","山形県","福島県","茨城県","栃木県","群馬県","埼玉県","千葉県","東京都","神奈川県","新潟県","富山県","石川県","福井県","山梨県","長野県","岐阜県","静岡県","愛知県","三重県","滋賀県","京都府","大阪府","兵庫県","奈良県","和歌山県","鳥取県","島根県","岡山県","広島県","山口県","徳島県","香川県","愛媛県","高知県","福岡県","佐賀県","長崎県","熊本県","大分県","宮崎県","鹿児島県","沖縄県"]

const skill_data =
[
    {'occupation':'回避','p':["dex",2]},//dex2
    {'occupation':'キック','p':25},
    {'occupation':'組みつき','p':25},
    {'occupation':'こぶし','p':50},
    {'occupation':'頭突き','p':10},
    {'occupation':'投擲','p':25},
    {'occupation':'マーシャルアーツ','p':1},
    {'occupation':'拳銃','p':20},
    {'occupation':'サブマシンガン','p':15},
    {'occupation':'ショットガン','p':30},
    {'occupation':'マシンガン','p':15},
    {'occupation':'ライフル','p':25},
    {'occupation':'スタンガン','p':30},
    {'occupation':'応急手当','p':30},
    {'occupation':'鍵開け','p':1},
    {'occupation':'隠す','p':15},
    {'occupation':'隠れる','p':10},
    {'occupation':'聞き耳','p':25},
    {'occupation':'忍び歩き','p':10},
    {'occupation':'写真術','p':10},
    {'occupation':'精神分析','p':1},
    {'occupation':'追跡','p':10},
    {'occupation':'登攀','p':40},
    {'occupation':'図書館','p':25},
    {'occupation':'目星','p':25},
    {'occupation':'運転','p':20},
    {'occupation':'機械修理','p':20},
    {'occupation':'重機械操作','p':1},
    {'occupation':'乗馬','p':5},
    {'occupation':'水泳','p':25},
    {'occupation':'製作','p':5},
    {'occupation':'操縦','p':1},
    {'occupation':'跳躍','p':1},
    {'occupation':'電気修理','p':10},
    {'occupation':'ナビゲート','p':10},
    {'occupation':'変装','p':1},
    {'occupation':'言いくるめ','p':5},
    {'occupation':'信用','p':15},
    {'occupation':'説得','p':15},
    {'occupation':'母国語','p':["edu",5]},
    {'occupation':'ほかの言語','p':1},
    {'occupation':'医学','p':5},
    {'occupation':'オカルト','p':5},
    {'occupation':'化学','p':1},
    {'occupation':'クトゥルフ神話','p':0},
    {'occupation':'芸術','p':5},
    {'occupation':'経理','p':10},
    {'occupation':'考古学','p':1},
    {'occupation':'人類学','p':1},
    {'occupation':'コンピューター','p':1},
    {'occupation':'心理学','p':5},
    {'occupation':'生物学','p':1},
    {'occupation':'地質学','p':1},
    {'occupation':'電子工学','p':1},
    {'occupation':'天文学','p':1},
    {'occupation':'博物学','p':10},
    {'occupation':'物理学','p':1},
    {'occupation':'法律','p':5},
    {'occupation':'薬学','p':1},
    {'occupation':'歴史','p':20},
    {'occupation':'フェンシング','p':20},
    {'occupation':'サーベル','p':15},
    {'occupation':'チェーンソー','p':20},
    {'occupation':'ナイフ','p':25},
    {'occupation':'日本刀','p':15},
    {'occupation':'青龍刀','p':10},
    {'occupation':'薙刀','p':10},
    {'occupation':'杖','p':25},
    {'occupation':'鎖鎌','p':5},
    {'occupation':'節棍','p':5},
    {'occupation':'ムチ','p':5},
    {'occupation':'居合','p':1},
    {'occupation':'武道','p':1},
    {'occupation':'サバイバル','p':10},
    {'occupation':'値切り','p':5},
    {'occupation':'グレネード・ランチャー','p':25},
    {'occupation':'砲','p':1},
    {'occupation':'火縄銃','p':15}
]